<?php
/**
 * Created by PhpStorm.
 * User: qiping
 * Date: 2016/4/14
 * Time: 10:53
 */

//发回支持的城市地区
function getCities()
{
    return array(
        0 =>
            array(
                'province_name' => '北京市',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '市辖区',
                                'area' =>
                                    array(
                                        0 => '东城区',
                                        1 => '西城区',
                                        2 => '崇文区',
                                        3 => '宣武区',
                                        4 => '朝阳区',
                                        5 => '丰台区',
                                        6 => '石景山区',
                                        7 => '海淀区',
                                        8 => '门头沟区',
                                        9 => '房山区',
                                        10 => '通州区',
                                        11 => '顺义区',
                                        12 => '昌平区',
                                        13 => '大兴区',
                                        14 => '怀柔区',
                                        15 => '平谷区',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '北京周边',
                                'area' =>
                                    array(
                                        0 => '密云县',
                                        1 => '延庆县',
                                    ),
                            ),
                    ),
            ),
        1 =>
            array(
                'province_name' => '天津市',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '市辖区',
                                'area' =>
                                    array(
                                        0 => '和平区',
                                        1 => '河东区',
                                        2 => '河西区',
                                        3 => '南开区',
                                        4 => '河北区',
                                        5 => '红桥区',
                                        6 => '塘沽区',
                                        7 => '汉沽区',
                                        8 => '大港区',
                                        9 => '东丽区',
                                        10 => '西青区',
                                        11 => '津南区',
                                        12 => '北辰区',
                                        13 => '武清区',
                                        14 => '宝坻区',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '天津周边',
                                'area' =>
                                    array(
                                        0 => '宁河县',
                                        1 => '静海县',
                                        2 => '蓟　县',
                                    ),
                            ),
                    ),
            ),
        2 =>
            array(
                'province_name' => '河北省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '石家庄市',
                                'area' =>
                                    array(
                                        0 => '长安区',
                                        1 => '桥东区',
                                        2 => '桥西区',
                                        3 => '新华区',
                                        4 => '井陉矿区',
                                        5 => '裕华区',
                                        6 => '井陉县',
                                        7 => '正定县',
                                        8 => '栾城县',
                                        9 => '行唐县',
                                        10 => '灵寿县',
                                        11 => '高邑县',
                                        12 => '深泽县',
                                        13 => '赞皇县',
                                        14 => '无极县',
                                        15 => '平山县',
                                        16 => '元氏县',
                                        17 => '赵　县',
                                        18 => '辛集市',
                                        19 => '藁城市',
                                        20 => '晋州市',
                                        22 => '新乐市',
                                        23 => '鹿泉市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '唐山市',
                                'area' =>
                                    array(
                                        0 => '路南区',
                                        1 => '路北区',
                                        2 => '古冶区',
                                        3 => '开平区',
                                        4 => '丰南区',
                                        5 => '丰润区',
                                        6 => '滦　县',
                                        7 => '滦南县',
                                        8 => '乐亭县',
                                        9 => '迁西县',
                                        10 => '玉田县',
                                        11 => '唐海县',
                                        12 => '遵化市',
                                        13 => '迁安市',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '秦皇岛市',
                                'area' =>
                                    array(
                                        0 => '海港区',
                                        1 => '山海关区',
                                        2 => '北戴河区',
                                        3 => '青龙满族自治县',
                                        4 => '昌黎县',
                                        5 => '抚宁县',
                                        6 => '卢龙县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '邯郸市',
                                'area' =>
                                    array(
                                        0 => '邯山区',
                                        1 => '丛台区',
                                        2 => '复兴区',
                                        3 => '峰峰矿区',
                                        4 => '邯郸县',
                                        5 => '临漳县',
                                        6 => '成安县',
                                        7 => '大名县',
                                        8 => '涉　县',
                                        9 => '磁　县',
                                        10 => '肥乡县',
                                        11 => '永年县',
                                        12 => '邱　县',
                                        13 => '鸡泽县',
                                        14 => '广平县',
                                        15 => '馆陶县',
                                        16 => '魏　县',
                                        17 => '曲周县',
                                        18 => '武安市',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '邢台市',
                                'area' =>
                                    array(
                                        0 => '桥东区',
                                        1 => '桥西区',
                                        2 => '邢台县',
                                        3 => '临城县',
                                        4 => '内丘县',
                                        5 => '柏乡县',
                                        6 => '隆尧县',
                                        7 => '任　县',
                                        8 => '南和县',
                                        9 => '宁晋县',
                                        10 => '巨鹿县',
                                        11 => '新河县',
                                        12 => '广宗县',
                                        13 => '平乡县',
                                        14 => '威　县',
                                        15 => '清河县',
                                        16 => '临西县',
                                        17 => '南宫市',
                                        18 => '沙河市',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '保定市',
                                'area' =>
                                    array(
                                        0 => '新市区',
                                        1 => '北市区',
                                        2 => '南市区',
                                        3 => '满城县',
                                        4 => '清苑县',
                                        5 => '涞水县',
                                        6 => '阜平县',
                                        7 => '徐水县',
                                        8 => '定兴县',
                                        9 => '唐　县',
                                        10 => '高阳县',
                                        11 => '容城县',
                                        12 => '涞源县',
                                        13 => '望都县',
                                        14 => '安新县',
                                        15 => '易　县',
                                        16 => '曲阳县',
                                        17 => '蠡　县',
                                        18 => '顺平县',
                                        19 => '博野县',
                                        20 => '雄　县',
                                        21 => '涿州市',
                                        22 => '定州市',
                                        23 => '安国市',
                                        24 => '高碑店市',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '张家口市',
                                'area' =>
                                    array(
                                        0 => '桥东区',
                                        1 => '桥西区',
                                        2 => '宣化区',
                                        3 => '下花园区',
                                        4 => '宣化县',
                                        5 => '张北县',
                                        6 => '康保县',
                                        7 => '沽源县',
                                        8 => '尚义县',
                                        9 => '蔚　县',
                                        10 => '阳原县',
                                        11 => '怀安县',
                                        12 => '万全县',
                                        13 => '怀来县',
                                        14 => '涿鹿县',
                                        15 => '赤城县',
                                        16 => '崇礼县',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '承德市',
                                'area' =>
                                    array(
                                        0 => '双桥区',
                                        1 => '双滦区',
                                        2 => '鹰手营子矿区',
                                        3 => '承德县',
                                        4 => '兴隆县',
                                        5 => '平泉县',
                                        6 => '滦平县',
                                        7 => '隆化县',
                                        8 => '丰宁满族自治县',
                                        9 => '宽城满族自治县',
                                        10 => '围场满族蒙古族自治县',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '沧州市',
                                'area' =>
                                    array(
                                        0 => '新华区',
                                        1 => '运河区',
                                        2 => '沧　县',
                                        3 => '青　县',
                                        4 => '东光县',
                                        5 => '海兴县',
                                        6 => '盐山县',
                                        7 => '肃宁县',
                                        8 => '南皮县',
                                        9 => '吴桥县',
                                        10 => '献　县',
                                        11 => '孟村回族自治县',
                                        12 => '泊头市',
                                        13 => '任丘市',
                                        14 => '黄骅市',
                                        15 => '河间市',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '廊坊市',
                                'area' =>
                                    array(
                                        0 => '安次区',
                                        1 => '广阳区',
                                        2 => '固安县',
                                        3 => '永清县',
                                        4 => '香河县',
                                        5 => '大城县',
                                        6 => '文安县',
                                        7 => '大厂回族自治县',
                                        8 => '霸州市',
                                        9 => '三河市',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '衡水市',
                                'area' =>
                                    array(
                                        0 => '桃城区',
                                        1 => '枣强县',
                                        2 => '武邑县',
                                        3 => '武强县',
                                        4 => '饶阳县',
                                        5 => '安平县',
                                        6 => '故城县',
                                        7 => '景　县',
                                        8 => '阜城县',
                                        9 => '冀州市',
                                        10 => '深州市',
                                    ),
                            ),
                    ),
            ),
        3 =>
            array(
                'province_name' => '山西省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '太原市',
                                'area' =>
                                    array(
                                        0 => '小店区',
                                        1 => '迎泽区',
                                        2 => '杏花岭区',
                                        3 => '尖草坪区',
                                        4 => '万柏林区',
                                        5 => '晋源区',
                                        6 => '清徐县',
                                        7 => '阳曲县',
                                        8 => '娄烦县',
                                        9 => '古交市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '大同市',
                                'area' =>
                                    array(
                                        0 => '城　区',
                                        1 => '矿　区',
                                        2 => '南郊区',
                                        3 => '新荣区',
                                        4 => '阳高县',
                                        5 => '天镇县',
                                        6 => '广灵县',
                                        7 => '灵丘县',
                                        8 => '浑源县',
                                        9 => '左云县',
                                        10 => '大同县',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '阳泉市',
                                'area' =>
                                    array(
                                        0 => '城　区',
                                        1 => '矿　区',
                                        2 => '郊　区',
                                        3 => '平定县',
                                        4 => '盂　县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '长治市',
                                'area' =>
                                    array(
                                        0 => '城　区',
                                        1 => '郊　区',
                                        2 => '长治县',
                                        3 => '襄垣县',
                                        4 => '屯留县',
                                        5 => '平顺县',
                                        6 => '黎城县',
                                        7 => '壶关县',
                                        8 => '长子县',
                                        9 => '武乡县',
                                        10 => '沁　县',
                                        11 => '沁源县',
                                        12 => '潞城市',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '晋城市',
                                'area' =>
                                    array(
                                        0 => '城　区',
                                        1 => '沁水县',
                                        2 => '阳城县',
                                        3 => '陵川县',
                                        4 => '泽州县',
                                        5 => '高平市',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '朔州市',
                                'area' =>
                                    array(
                                        0 => '朔城区',
                                        1 => '平鲁区',
                                        2 => '山阴县',
                                        3 => '应　县',
                                        4 => '右玉县',
                                        5 => '怀仁县',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '晋中市',
                                'area' =>
                                    array(
                                        0 => '榆次区',
                                        1 => '榆社县',
                                        2 => '左权县',
                                        3 => '和顺县',
                                        4 => '昔阳县',
                                        5 => '寿阳县',
                                        6 => '太谷县',
                                        7 => '祁　县',
                                        8 => '平遥县',
                                        9 => '灵石县',
                                        10 => '介休市',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '运城市',
                                'area' =>
                                    array(
                                        0 => '盐湖区',
                                        1 => '临猗县',
                                        2 => '万荣县',
                                        3 => '闻喜县',
                                        4 => '稷山县',
                                        5 => '新绛县',
                                        6 => '绛　县',
                                        7 => '垣曲县',
                                        8 => '夏　县',
                                        9 => '平陆县',
                                        10 => '芮城县',
                                        11 => '永济市',
                                        12 => '河津市',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '忻州市',
                                'area' =>
                                    array(
                                        0 => '忻府区',
                                        1 => '定襄县',
                                        2 => '五台县',
                                        3 => '代　县',
                                        4 => '繁峙县',
                                        5 => '宁武县',
                                        6 => '静乐县',
                                        7 => '神池县',
                                        8 => '五寨县',
                                        9 => '岢岚县',
                                        10 => '河曲县',
                                        11 => '保德县',
                                        12 => '偏关县',
                                        13 => '原平市',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '临汾市',
                                'area' =>
                                    array(
                                        0 => '尧都区',
                                        1 => '曲沃县',
                                        2 => '翼城县',
                                        3 => '襄汾县',
                                        4 => '洪洞县',
                                        5 => '古　县',
                                        6 => '安泽县',
                                        7 => '浮山县',
                                        8 => '吉　县',
                                        9 => '乡宁县',
                                        10 => '大宁县',
                                        11 => '隰　县',
                                        12 => '永和县',
                                        13 => '蒲　县',
                                        14 => '汾西县',
                                        15 => '侯马市',
                                        16 => '霍州市',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '吕梁市',
                                'area' =>
                                    array(
                                        0 => '离石区',
                                        1 => '文水县',
                                        2 => '交城县',
                                        3 => '兴　县',
                                        4 => '临　县',
                                        5 => '柳林县',
                                        6 => '石楼县',
                                        7 => '岚　县',
                                        8 => '方山县',
                                        9 => '中阳县',
                                        10 => '交口县',
                                        11 => '孝义市',
                                        12 => '汾阳市',
                                    ),
                            ),
                    ),
            ),
        4 =>
            array(
                'province_name' => '内蒙古自治区',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '呼和浩特市',
                                'area' =>
                                    array(
                                        0 => '新城区',
                                        1 => '回民区',
                                        2 => '玉泉区',
                                        3 => '赛罕区',
                                        4 => '土默特左旗',
                                        5 => '托克托县',
                                        6 => '和林格尔县',
                                        7 => '清水河县',
                                        8 => '武川县',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '包头市',
                                'area' =>
                                    array(
                                        0 => '东河区',
                                        1 => '昆都仑区',
                                        2 => '青山区',
                                        3 => '石拐区',
                                        4 => '白云矿区',
                                        5 => '九原区',
                                        6 => '土默特右旗',
                                        7 => '固阳县',
                                        8 => '达尔罕茂明安联合旗',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '乌海市',
                                'area' =>
                                    array(
                                        0 => '海勃湾区',
                                        1 => '海南区',
                                        2 => '乌达区',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '赤峰市',
                                'area' =>
                                    array(
                                        0 => '红山区',
                                        1 => '元宝山区',
                                        2 => '松山区',
                                        3 => '阿鲁科尔沁旗',
                                        4 => '巴林左旗',
                                        5 => '巴林右旗',
                                        6 => '林西县',
                                        7 => '克什克腾旗',
                                        8 => '翁牛特旗',
                                        9 => '喀喇沁旗',
                                        10 => '宁城县',
                                        11 => '敖汉旗',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '通辽市',
                                'area' =>
                                    array(
                                        0 => '科尔沁区',
                                        1 => '科尔沁左翼中旗',
                                        2 => '科尔沁左翼后旗',
                                        3 => '开鲁县',
                                        4 => '库伦旗',
                                        5 => '奈曼旗',
                                        6 => '扎鲁特旗',
                                        7 => '霍林郭勒市',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '鄂尔多斯市',
                                'area' =>
                                    array(
                                        0 => '东胜区',
                                        1 => '达拉特旗',
                                        2 => '准格尔旗',
                                        3 => '鄂托克前旗',
                                        4 => '鄂托克旗',
                                        5 => '杭锦旗',
                                        6 => '乌审旗',
                                        7 => '伊金霍洛旗',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '呼伦贝尔市',
                                'area' =>
                                    array(
                                        0 => '海拉尔区',
                                        1 => '阿荣旗',
                                        2 => '莫力达瓦达斡尔族自治旗',
                                        3 => '鄂伦春自治旗',
                                        4 => '鄂温克族自治旗',
                                        5 => '陈巴尔虎旗',
                                        6 => '新巴尔虎左旗',
                                        7 => '新巴尔虎右旗',
                                        8 => '满洲里市',
                                        9 => '牙克石市',
                                        10 => '扎兰屯市',
                                        11 => '额尔古纳市',
                                        12 => '根河市',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '巴彦淖尔市',
                                'area' =>
                                    array(
                                        0 => '临河区',
                                        1 => '五原县',
                                        2 => '磴口县',
                                        3 => '乌拉特前旗',
                                        4 => '乌拉特中旗',
                                        5 => '乌拉特后旗',
                                        6 => '杭锦后旗',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '乌兰察布市',
                                'area' =>
                                    array(
                                        0 => '集宁区',
                                        1 => '卓资县',
                                        2 => '化德县',
                                        3 => '商都县',
                                        4 => '兴和县',
                                        5 => '凉城县',
                                        6 => '察哈尔右翼前旗',
                                        7 => '察哈尔右翼中旗',
                                        8 => '察哈尔右翼后旗',
                                        9 => '四子王旗',
                                        10 => '丰镇市',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '兴安盟',
                                'area' =>
                                    array(
                                        0 => '乌兰浩特市',
                                        1 => '阿尔山市',
                                        2 => '科尔沁右翼前旗',
                                        3 => '科尔沁右翼中旗',
                                        4 => '扎赉特旗',
                                        5 => '突泉县',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '锡林郭勒盟',
                                'area' =>
                                    array(
                                        0 => '二连浩特市',
                                        1 => '锡林浩特市',
                                        2 => '阿巴嘎旗',
                                        3 => '苏尼特左旗',
                                        4 => '苏尼特右旗',
                                        5 => '东乌珠穆沁旗',
                                        6 => '西乌珠穆沁旗',
                                        7 => '太仆寺旗',
                                        8 => '镶黄旗',
                                        9 => '正镶白旗',
                                        10 => '正蓝旗',
                                        11 => '多伦县',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '阿拉善盟',
                                'area' =>
                                    array(
                                        0 => '阿拉善左旗',
                                        1 => '阿拉善右旗',
                                        2 => '额济纳旗',
                                    ),
                            ),
                    ),
            ),
        5 =>
            array(
                'province_name' => '辽宁省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '沈阳市',
                                'area' =>
                                    array(
                                        0 => '和平区',
                                        1 => '沈河区',
                                        2 => '大东区',
                                        3 => '皇姑区',
                                        4 => '铁西区',
                                        5 => '苏家屯区',
                                        6 => '东陵区',
                                        7 => '新城子区',
                                        8 => '于洪区',
                                        9 => '辽中县',
                                        10 => '康平县',
                                        11 => '法库县',
                                        12 => '新民市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '大连市',
                                'area' =>
                                    array(
                                        0 => '中山区',
                                        1 => '西岗区',
                                        2 => '沙河口区',
                                        3 => '甘井子区',
                                        4 => '旅顺口区',
                                        5 => '金州区',
                                        6 => '长海县',
                                        7 => '瓦房店市',
                                        8 => '普兰店市',
                                        9 => '庄河市',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '鞍山市',
                                'area' =>
                                    array(
                                        0 => '铁东区',
                                        1 => '铁西区',
                                        2 => '立山区',
                                        3 => '千山区',
                                        4 => '台安县',
                                        5 => '岫岩满族自治县',
                                        6 => '海城市',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '抚顺市',
                                'area' =>
                                    array(
                                        0 => '新抚区',
                                        1 => '东洲区',
                                        2 => '望花区',
                                        3 => '顺城区',
                                        4 => '抚顺县',
                                        5 => '新宾满族自治县',
                                        6 => '清原满族自治县',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '本溪市',
                                'area' =>
                                    array(
                                        0 => '平山区',
                                        1 => '溪湖区',
                                        2 => '明山区',
                                        3 => '南芬区',
                                        4 => '本溪满族自治县',
                                        5 => '桓仁满族自治县',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '丹东市',
                                'area' =>
                                    array(
                                        0 => '元宝区',
                                        1 => '振兴区',
                                        2 => '振安区',
                                        3 => '宽甸满族自治县',
                                        4 => '东港市',
                                        5 => '凤城市',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '锦州市',
                                'area' =>
                                    array(
                                        0 => '古塔区',
                                        1 => '凌河区',
                                        2 => '太和区',
                                        3 => '黑山县',
                                        4 => '义　县',
                                        5 => '凌海市',
                                        6 => '北宁市',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '营口市',
                                'area' =>
                                    array(
                                        0 => '站前区',
                                        1 => '西市区',
                                        2 => '鲅鱼圈区',
                                        3 => '老边区',
                                        4 => '盖州市',
                                        5 => '大石桥市',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '阜新市',
                                'area' =>
                                    array(
                                        0 => '海州区',
                                        1 => '新邱区',
                                        2 => '太平区',
                                        3 => '清河门区',
                                        4 => '细河区',
                                        5 => '阜新蒙古族自治县',
                                        6 => '彰武县',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '辽阳市',
                                'area' =>
                                    array(
                                        0 => '白塔区',
                                        1 => '文圣区',
                                        2 => '宏伟区',
                                        3 => '弓长岭区',
                                        4 => '太子河区',
                                        5 => '辽阳县',
                                        6 => '灯塔市',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '盘锦市',
                                'area' =>
                                    array(
                                        0 => '双台子区',
                                        1 => '兴隆台区',
                                        2 => '大洼县',
                                        3 => '盘山县',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '铁岭市',
                                'area' =>
                                    array(
                                        0 => '银州区',
                                        1 => '清河区',
                                        2 => '铁岭县',
                                        3 => '西丰县',
                                        4 => '昌图县',
                                        5 => '调兵山市',
                                        6 => '开原市',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '朝阳市',
                                'area' =>
                                    array(
                                        0 => '双塔区',
                                        1 => '龙城区',
                                        2 => '朝阳县',
                                        3 => '建平县',
                                        4 => '喀喇沁左翼蒙古族自治县',
                                        5 => '北票市',
                                        6 => '凌源市',
                                    ),
                            ),
                        13 =>
                            array(
                                'city_name' => '葫芦岛市',
                                'area' =>
                                    array(
                                        0 => '连山区',
                                        1 => '龙港区',
                                        2 => '南票区',
                                        3 => '绥中县',
                                        4 => '建昌县',
                                        5 => '兴城市',
                                    ),
                            ),
                    ),
            ),
        6 =>
            array(
                'province_name' => '吉林省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '长春市',
                                'area' =>
                                    array(
                                        0 => '南关区',
                                        1 => '宽城区',
                                        2 => '朝阳区',
                                        3 => '二道区',
                                        4 => '绿园区',
                                        5 => '双阳区',
                                        6 => '农安县',
                                        7 => '九台市',
                                        8 => '榆树市',
                                        9 => '德惠市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '吉林市',
                                'area' =>
                                    array(
                                        0 => '昌邑区',
                                        1 => '龙潭区',
                                        2 => '船营区',
                                        3 => '丰满区',
                                        4 => '永吉县',
                                        5 => '蛟河市',
                                        6 => '桦甸市',
                                        7 => '舒兰市',
                                        8 => '磐石市',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '四平市',
                                'area' =>
                                    array(
                                        0 => '铁西区',
                                        1 => '铁东区',
                                        2 => '梨树县',
                                        3 => '伊通满族自治县',
                                        4 => '公主岭市',
                                        5 => '双辽市',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '辽源市',
                                'area' =>
                                    array(
                                        0 => '龙山区',
                                        1 => '西安区',
                                        2 => '东丰县',
                                        3 => '东辽县',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '通化市',
                                'area' =>
                                    array(
                                        0 => '东昌区',
                                        1 => '二道江区',
                                        2 => '通化县',
                                        3 => '辉南县',
                                        4 => '柳河县',
                                        5 => '梅河口市',
                                        6 => '集安市',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '白山市',
                                'area' =>
                                    array(
                                        0 => '八道江区',
                                        1 => '抚松县',
                                        2 => '靖宇县',
                                        3 => '长白朝鲜族自治县',
                                        4 => '江源县',
                                        5 => '临江市',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '松原市',
                                'area' =>
                                    array(
                                        0 => '宁江区',
                                        1 => '前郭尔罗斯蒙古族自治县',
                                        2 => '长岭县',
                                        3 => '乾安县',
                                        4 => '扶余县',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '白城市',
                                'area' =>
                                    array(
                                        0 => '洮北区',
                                        1 => '镇赉县',
                                        2 => '通榆县',
                                        3 => '洮南市',
                                        4 => '大安市',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '延边朝鲜族自治州',
                                'area' =>
                                    array(
                                        0 => '延吉市',
                                        1 => '图们市',
                                        2 => '敦化市',
                                        3 => '珲春市',
                                        4 => '龙井市',
                                        5 => '和龙市',
                                        6 => '汪清县',
                                        7 => '安图县',
                                    ),
                            ),
                    ),
            ),
        7 =>
            array(
                'province_name' => '黑龙江省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '哈尔滨市',
                                'area' =>
                                    array(
                                        0 => '道里区',
                                        1 => '南岗区',
                                        2 => '道外区',
                                        3 => '香坊区',
                                        4 => '动力区',
                                        5 => '平房区',
                                        6 => '松北区',
                                        7 => '呼兰区',
                                        8 => '依兰县',
                                        9 => '方正县',
                                        10 => '宾　县',
                                        11 => '巴彦县',
                                        12 => '木兰县',
                                        13 => '通河县',
                                        14 => '延寿县',
                                        15 => '阿城市',
                                        16 => '双城市',
                                        17 => '尚志市',
                                        18 => '五常市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '齐齐哈尔市',
                                'area' =>
                                    array(
                                        0 => '龙沙区',
                                        1 => '建华区',
                                        2 => '铁锋区',
                                        3 => '昂昂溪区',
                                        4 => '富拉尔基区',
                                        5 => '碾子山区',
                                        6 => '梅里斯达斡尔族区',
                                        7 => '龙江县',
                                        8 => '依安县',
                                        9 => '泰来县',
                                        10 => '甘南县',
                                        11 => '富裕县',
                                        12 => '克山县',
                                        13 => '克东县',
                                        14 => '拜泉县',
                                        15 => '讷河市',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '鸡西市',
                                'area' =>
                                    array(
                                        0 => '鸡冠区',
                                        1 => '恒山区',
                                        2 => '滴道区',
                                        3 => '梨树区',
                                        4 => '城子河区',
                                        5 => '麻山区',
                                        6 => '鸡东县',
                                        7 => '虎林市',
                                        8 => '密山市',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '鹤岗市',
                                'area' =>
                                    array(
                                        0 => '向阳区',
                                        1 => '工农区',
                                        2 => '南山区',
                                        3 => '兴安区',
                                        4 => '东山区',
                                        5 => '兴山区',
                                        6 => '萝北县',
                                        7 => '绥滨县',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '双鸭山市',
                                'area' =>
                                    array(
                                        0 => '尖山区',
                                        1 => '岭东区',
                                        2 => '四方台区',
                                        3 => '宝山区',
                                        4 => '集贤县',
                                        5 => '友谊县',
                                        6 => '宝清县',
                                        7 => '饶河县',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '大庆市',
                                'area' =>
                                    array(
                                        0 => '萨尔图区',
                                        1 => '龙凤区',
                                        2 => '让胡路区',
                                        3 => '红岗区',
                                        4 => '大同区',
                                        5 => '肇州县',
                                        6 => '肇源县',
                                        7 => '林甸县',
                                        8 => '杜尔伯特蒙古族自治县',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '伊春市',
                                'area' =>
                                    array(
                                        0 => '伊春区',
                                        1 => '南岔区',
                                        2 => '友好区',
                                        3 => '西林区',
                                        4 => '翠峦区',
                                        5 => '新青区',
                                        6 => '美溪区',
                                        7 => '金山屯区',
                                        8 => '五营区',
                                        9 => '乌马河区',
                                        10 => '汤旺河区',
                                        11 => '带岭区',
                                        12 => '乌伊岭区',
                                        13 => '红星区',
                                        14 => '上甘岭区',
                                        15 => '嘉荫县',
                                        16 => '铁力市',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '佳木斯市',
                                'area' =>
                                    array(
                                        0 => '永红区',
                                        1 => '向阳区',
                                        2 => '前进区',
                                        3 => '东风区',
                                        4 => '郊　区',
                                        5 => '桦南县',
                                        6 => '桦川县',
                                        7 => '汤原县',
                                        8 => '抚远县',
                                        9 => '同江市',
                                        10 => '富锦市',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '七台河市',
                                'area' =>
                                    array(
                                        0 => '新兴区',
                                        1 => '桃山区',
                                        2 => '茄子河区',
                                        3 => '勃利县',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '牡丹江市',
                                'area' =>
                                    array(
                                        0 => '东安区',
                                        1 => '阳明区',
                                        2 => '爱民区',
                                        3 => '西安区',
                                        4 => '东宁县',
                                        5 => '林口县',
                                        6 => '绥芬河市',
                                        7 => '海林市',
                                        8 => '宁安市',
                                        9 => '穆棱市',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '黑河市',
                                'area' =>
                                    array(
                                        0 => '爱辉区',
                                        1 => '嫩江县',
                                        2 => '逊克县',
                                        3 => '孙吴县',
                                        4 => '北安市',
                                        5 => '五大连池市',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '绥化市',
                                'area' =>
                                    array(
                                        0 => '北林区',
                                        1 => '望奎县',
                                        2 => '兰西县',
                                        3 => '青冈县',
                                        4 => '庆安县',
                                        5 => '明水县',
                                        6 => '绥棱县',
                                        7 => '安达市',
                                        8 => '肇东市',
                                        9 => '海伦市',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '大兴安岭地区',
                                'area' =>
                                    array(
                                        0 => '呼玛县',
                                        1 => '塔河县',
                                        2 => '漠河县',
                                    ),
                            ),
                    ),
            ),
        8 =>
            array(
                'province_name' => '上海市',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '市辖区',
                                'area' =>
                                    array(
                                        0 => '黄浦区',
                                        1 => '卢湾区',
                                        2 => '徐汇区',
                                        3 => '长宁区',
                                        4 => '静安区',
                                        5 => '普陀区',
                                        6 => '闸北区',
                                        7 => '虹口区',
                                        8 => '杨浦区',
                                        9 => '闵行区',
                                        10 => '宝山区',
                                        11 => '嘉定区',
                                        12 => '浦东新区',
                                        13 => '金山区',
                                        14 => '松江区',
                                        15 => '青浦区',
                                        16 => '南汇区',
                                        17 => '奉贤区',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '上海周边',
                                'area' =>
                                    array(
                                        0 => '崇明县',
                                    ),
                            ),
                    ),
            ),
        9 =>
            array(
                'province_name' => '江苏省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '南京市',
                                'area' =>
                                    array(
                                        0 => '玄武区',
                                        1 => '白下区',
                                        2 => '秦淮区',
                                        3 => '建邺区',
                                        4 => '鼓楼区',
                                        5 => '下关区',
                                        6 => '浦口区',
                                        7 => '栖霞区',
                                        8 => '雨花台区',
                                        9 => '江宁区',
                                        10 => '六合区',
                                        11 => '溧水县',
                                        12 => '高淳县',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '无锡市',
                                'area' =>
                                    array(
                                        0 => '崇安区',
                                        1 => '南长区',
                                        2 => '北塘区',
                                        3 => '锡山区',
                                        4 => '惠山区',
                                        5 => '滨湖区',
                                        6 => '江阴市',
                                        7 => '宜兴市',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '徐州市',
                                'area' =>
                                    array(
                                        0 => '鼓楼区',
                                        1 => '云龙区',
                                        2 => '九里区',
                                        3 => '贾汪区',
                                        4 => '泉山区',
                                        5 => '丰　县',
                                        6 => '沛　县',
                                        7 => '铜山县',
                                        8 => '睢宁县',
                                        9 => '新沂市',
                                        10 => '邳州市',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '常州市',
                                'area' =>
                                    array(
                                        0 => '天宁区',
                                        1 => '钟楼区',
                                        2 => '戚墅堰区',
                                        3 => '新北区',
                                        4 => '武进区',
                                        5 => '溧阳市',
                                        6 => '金坛市',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '苏州市',
                                'area' =>
                                    array(
                                        0 => '沧浪区',
                                        1 => '平江区',
                                        2 => '金阊区',
                                        3 => '虎丘区',
                                        4 => '吴中区',
                                        5 => '相城区',
                                        6 => '常熟市',
                                        7 => '张家港市',
                                        8 => '昆山市',
                                        9 => '吴江市',
                                        10 => '太仓市',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '南通市',
                                'area' =>
                                    array(
                                        0 => '崇川区',
                                        1 => '港闸区',
                                        2 => '海安县',
                                        3 => '如东县',
                                        4 => '启东市',
                                        5 => '如皋市',
                                        6 => '通州市',
                                        7 => '海门市',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '连云港市',
                                'area' =>
                                    array(
                                        0 => '连云区',
                                        1 => '新浦区',
                                        2 => '海州区',
                                        3 => '赣榆县',
                                        4 => '东海县',
                                        5 => '灌云县',
                                        6 => '灌南县',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '淮安市',
                                'area' =>
                                    array(
                                        0 => '清河区',
                                        1 => '楚州区',
                                        2 => '淮阴区',
                                        3 => '清浦区',
                                        4 => '涟水县',
                                        5 => '洪泽县',
                                        6 => '盱眙县',
                                        7 => '金湖县',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '盐城市',
                                'area' =>
                                    array(
                                        0 => '亭湖区',
                                        1 => '盐都区',
                                        2 => '响水县',
                                        3 => '滨海县',
                                        4 => '阜宁县',
                                        5 => '射阳县',
                                        6 => '建湖县',
                                        7 => '东台市',
                                        8 => '大丰市',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '扬州市',
                                'area' =>
                                    array(
                                        0 => '广陵区',
                                        1 => '邗江区',
                                        2 => '郊　区',
                                        3 => '宝应县',
                                        4 => '仪征市',
                                        5 => '高邮市',
                                        6 => '江都市',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '镇江市',
                                'area' =>
                                    array(
                                        0 => '京口区',
                                        1 => '润州区',
                                        2 => '丹徒区',
                                        3 => '丹阳市',
                                        4 => '扬中市',
                                        5 => '句容市',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '泰州市',
                                'area' =>
                                    array(
                                        0 => '海陵区',
                                        1 => '高港区',
                                        2 => '兴化市',
                                        3 => '靖江市',
                                        4 => '泰兴市',
                                        5 => '姜堰市',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '宿迁市',
                                'area' =>
                                    array(
                                        0 => '宿城区',
                                        1 => '宿豫区',
                                        2 => '沭阳县',
                                        3 => '泗阳县',
                                        4 => '泗洪县',
                                    ),
                            ),
                    ),
            ),
        10 =>
            array(
                'province_name' => '浙江省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '杭州市',
                                'area' =>
                                    array(
                                        0 => '上城区',
                                        1 => '下城区',
                                        2 => '江干区',
                                        3 => '拱墅区',
                                        4 => '西湖区',
                                        5 => '滨江区',
                                        6 => '萧山区',
                                        7 => '余杭区',
                                        8 => '桐庐县',
                                        9 => '淳安县',
                                        10 => '建德市',
                                        11 => '富阳市',
                                        12 => '临安市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '宁波市',
                                'area' =>
                                    array(
                                        0 => '海曙区',
                                        1 => '江东区',
                                        2 => '江北区',
                                        3 => '北仑区',
                                        4 => '镇海区',
                                        5 => '鄞州区',
                                        6 => '象山县',
                                        7 => '宁海县',
                                        8 => '余姚市',
                                        9 => '慈溪市',
                                        10 => '奉化市',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '温州市',
                                'area' =>
                                    array(
                                        0 => '鹿城区',
                                        1 => '龙湾区',
                                        2 => '瓯海区',
                                        3 => '洞头县',
                                        4 => '永嘉县',
                                        5 => '平阳县',
                                        6 => '苍南县',
                                        7 => '文成县',
                                        8 => '泰顺县',
                                        9 => '瑞安市',
                                        10 => '乐清市',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '嘉兴市',
                                'area' =>
                                    array(
                                        0 => '秀城区',
                                        1 => '秀洲区',
                                        2 => '嘉善县',
                                        3 => '海盐县',
                                        4 => '海宁市',
                                        5 => '平湖市',
                                        6 => '桐乡市',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '湖州市',
                                'area' =>
                                    array(
                                        0 => '吴兴区',
                                        1 => '南浔区',
                                        2 => '德清县',
                                        3 => '长兴县',
                                        4 => '安吉县',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '绍兴市',
                                'area' =>
                                    array(
                                        0 => '越城区',
                                        1 => '绍兴县',
                                        2 => '新昌县',
                                        3 => '诸暨市',
                                        4 => '上虞市',
                                        5 => '嵊州市',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '金华市',
                                'area' =>
                                    array(
                                        0 => '婺城区',
                                        1 => '金东区',
                                        2 => '武义县',
                                        3 => '浦江县',
                                        4 => '磐安县',
                                        5 => '兰溪市',
                                        6 => '义乌市',
                                        7 => '东阳市',
                                        8 => '永康市',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '衢州市',
                                'area' =>
                                    array(
                                        0 => '柯城区',
                                        1 => '衢江区',
                                        2 => '常山县',
                                        3 => '开化县',
                                        4 => '龙游县',
                                        5 => '江山市',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '舟山市',
                                'area' =>
                                    array(
                                        0 => '定海区',
                                        1 => '普陀区',
                                        2 => '岱山县',
                                        3 => '嵊泗县',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '台州市',
                                'area' =>
                                    array(
                                        0 => '椒江区',
                                        1 => '黄岩区',
                                        2 => '路桥区',
                                        3 => '玉环县',
                                        4 => '三门县',
                                        5 => '天台县',
                                        6 => '仙居县',
                                        7 => '温岭市',
                                        8 => '临海市',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '丽水市',
                                'area' =>
                                    array(
                                        0 => '莲都区',
                                        1 => '青田县',
                                        2 => '缙云县',
                                        3 => '遂昌县',
                                        4 => '松阳县',
                                        5 => '云和县',
                                        6 => '庆元县',
                                        7 => '景宁畲族自治县',
                                        8 => '龙泉市',
                                    ),
                            ),
                    ),
            ),
        11 =>
            array(
                'province_name' => '安徽省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '合肥市',
                                'area' =>
                                    array(
                                        0 => '瑶海区',
                                        1 => '庐阳区',
                                        2 => '蜀山区',
                                        3 => '包河区',
                                        4 => '长丰县',
                                        5 => '肥东县',
                                        6 => '肥西县',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '芜湖市',
                                'area' =>
                                    array(
                                        0 => '镜湖区',
                                        1 => '马塘区',
                                        2 => '新芜区',
                                        3 => '鸠江区',
                                        4 => '芜湖县',
                                        5 => '繁昌县',
                                        6 => '南陵县',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '蚌埠市',
                                'area' =>
                                    array(
                                        0 => '龙子湖区',
                                        1 => '蚌山区',
                                        2 => '禹会区',
                                        3 => '淮上区',
                                        4 => '怀远县',
                                        5 => '五河县',
                                        6 => '固镇县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '淮南市',
                                'area' =>
                                    array(
                                        0 => '大通区',
                                        1 => '田家庵区',
                                        2 => '谢家集区',
                                        3 => '八公山区',
                                        4 => '潘集区',
                                        5 => '凤台县',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '马鞍山市',
                                'area' =>
                                    array(
                                        0 => '金家庄区',
                                        1 => '花山区',
                                        2 => '雨山区',
                                        3 => '当涂县',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '淮北市',
                                'area' =>
                                    array(
                                        0 => '杜集区',
                                        1 => '相山区',
                                        2 => '烈山区',
                                        3 => '濉溪县',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '铜陵市',
                                'area' =>
                                    array(
                                        0 => '铜官山区',
                                        1 => '狮子山区',
                                        2 => '郊　区',
                                        3 => '铜陵县',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '安庆市',
                                'area' =>
                                    array(
                                        0 => '迎江区',
                                        1 => '大观区',
                                        2 => '郊　区',
                                        3 => '怀宁县',
                                        4 => '枞阳县',
                                        5 => '潜山县',
                                        6 => '太湖县',
                                        7 => '宿松县',
                                        8 => '望江县',
                                        9 => '岳西县',
                                        10 => '桐城市',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '黄山市',
                                'area' =>
                                    array(
                                        0 => '屯溪区',
                                        1 => '黄山区',
                                        2 => '徽州区',
                                        3 => '歙　县',
                                        4 => '休宁县',
                                        5 => '黟　县',
                                        6 => '祁门县',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '滁州市',
                                'area' =>
                                    array(
                                        0 => '琅琊区',
                                        1 => '南谯区',
                                        2 => '来安县',
                                        3 => '全椒县',
                                        4 => '定远县',
                                        5 => '凤阳县',
                                        6 => '天长市',
                                        7 => '明光市',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '阜阳市',
                                'area' =>
                                    array(
                                        0 => '颍州区',
                                        1 => '颍东区',
                                        2 => '颍泉区',
                                        3 => '临泉县',
                                        4 => '太和县',
                                        5 => '阜南县',
                                        6 => '颍上县',
                                        7 => '界首市',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '宿州市',
                                'area' =>
                                    array(
                                        0 => '墉桥区',
                                        1 => '砀山县',
                                        2 => '萧　县',
                                        3 => '灵璧县',
                                        4 => '泗　县',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '巢湖市',
                                'area' =>
                                    array(
                                        0 => '居巢区',
                                        1 => '庐江县',
                                        2 => '无为县',
                                        3 => '含山县',
                                        4 => '和　县',
                                    ),
                            ),
                        13 =>
                            array(
                                'city_name' => '六安市',
                                'area' =>
                                    array(
                                        0 => '金安区',
                                        1 => '裕安区',
                                        2 => '寿　县',
                                        3 => '霍邱县',
                                        4 => '舒城县',
                                        5 => '金寨县',
                                        6 => '霍山县',
                                    ),
                            ),
                        14 =>
                            array(
                                'city_name' => '亳州市',
                                'area' =>
                                    array(
                                        0 => '谯城区',
                                        1 => '涡阳县',
                                        2 => '蒙城县',
                                        3 => '利辛县',
                                    ),
                            ),
                        15 =>
                            array(
                                'city_name' => '池州市',
                                'area' =>
                                    array(
                                        0 => '贵池区',
                                        1 => '东至县',
                                        2 => '石台县',
                                        3 => '青阳县',
                                    ),
                            ),
                        16 =>
                            array(
                                'city_name' => '宣城市',
                                'area' =>
                                    array(
                                        0 => '宣州区',
                                        1 => '郎溪县',
                                        2 => '广德县',
                                        3 => '泾　县',
                                        4 => '绩溪县',
                                        5 => '旌德县',
                                        6 => '宁国市',
                                    ),
                            ),
                    ),
            ),
        12 =>
            array(
                'province_name' => '福建省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '福州市',
                                'area' =>
                                    array(
                                        0 => '鼓楼区',
                                        1 => '台江区',
                                        2 => '仓山区',
                                        3 => '马尾区',
                                        4 => '晋安区',
                                        5 => '闽侯县',
                                        6 => '连江县',
                                        7 => '罗源县',
                                        8 => '闽清县',
                                        9 => '永泰县',
                                        10 => '平潭县',
                                        11 => '福清市',
                                        12 => '长乐市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '厦门市',
                                'area' =>
                                    array(
                                        0 => '思明区',
                                        1 => '海沧区',
                                        2 => '湖里区',
                                        3 => '集美区',
                                        4 => '同安区',
                                        5 => '翔安区',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '莆田市',
                                'area' =>
                                    array(
                                        0 => '城厢区',
                                        1 => '涵江区',
                                        2 => '荔城区',
                                        3 => '秀屿区',
                                        4 => '仙游县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '三明市',
                                'area' =>
                                    array(
                                        0 => '梅列区',
                                        1 => '三元区',
                                        2 => '明溪县',
                                        3 => '清流县',
                                        4 => '宁化县',
                                        5 => '大田县',
                                        6 => '尤溪县',
                                        7 => '沙　县',
                                        8 => '将乐县',
                                        9 => '泰宁县',
                                        10 => '建宁县',
                                        11 => '永安市',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '泉州市',
                                'area' =>
                                    array(
                                        0 => '鲤城区',
                                        1 => '丰泽区',
                                        2 => '洛江区',
                                        3 => '泉港区',
                                        4 => '惠安县',
                                        5 => '安溪县',
                                        6 => '永春县',
                                        7 => '德化县',
                                        8 => '金门县',
                                        9 => '石狮市',
                                        10 => '晋江市',
                                        11 => '南安市',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '漳州市',
                                'area' =>
                                    array(
                                        0 => '芗城区',
                                        1 => '龙文区',
                                        2 => '云霄县',
                                        3 => '漳浦县',
                                        4 => '诏安县',
                                        5 => '长泰县',
                                        6 => '东山县',
                                        7 => '南靖县',
                                        8 => '平和县',
                                        9 => '华安县',
                                        10 => '龙海市',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '南平市',
                                'area' =>
                                    array(
                                        0 => '延平区',
                                        1 => '顺昌县',
                                        2 => '浦城县',
                                        3 => '光泽县',
                                        4 => '松溪县',
                                        5 => '政和县',
                                        6 => '邵武市',
                                        7 => '武夷山市',
                                        8 => '建瓯市',
                                        9 => '建阳市',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '龙岩市',
                                'area' =>
                                    array(
                                        0 => '新罗区',
                                        1 => '长汀县',
                                        2 => '永定县',
                                        3 => '上杭县',
                                        4 => '武平县',
                                        5 => '连城县',
                                        6 => '漳平市',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '宁德市',
                                'area' =>
                                    array(
                                        0 => '蕉城区',
                                        1 => '霞浦县',
                                        2 => '古田县',
                                        3 => '屏南县',
                                        4 => '寿宁县',
                                        5 => '周宁县',
                                        6 => '柘荣县',
                                        7 => '福安市',
                                        8 => '福鼎市',
                                    ),
                            ),
                    ),
            ),
        13 =>
            array(
                'province_name' => '江西省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '南昌市',
                                'area' =>
                                    array(
                                        0 => '东湖区',
                                        1 => '西湖区',
                                        2 => '青云谱区',
                                        3 => '湾里区',
                                        4 => '青山湖区',
                                        5 => '南昌县',
                                        6 => '新建县',
                                        7 => '安义县',
                                        8 => '进贤县',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '景德镇市',
                                'area' =>
                                    array(
                                        0 => '昌江区',
                                        1 => '珠山区',
                                        2 => '浮梁县',
                                        3 => '乐平市',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '萍乡市',
                                'area' =>
                                    array(
                                        0 => '安源区',
                                        1 => '湘东区',
                                        2 => '莲花县',
                                        3 => '上栗县',
                                        4 => '芦溪县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '九江市',
                                'area' =>
                                    array(
                                        0 => '庐山区',
                                        1 => '浔阳区',
                                        2 => '九江县',
                                        3 => '武宁县',
                                        4 => '修水县',
                                        5 => '永修县',
                                        6 => '德安县',
                                        7 => '星子县',
                                        8 => '都昌县',
                                        9 => '湖口县',
                                        10 => '彭泽县',
                                        11 => '瑞昌市',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '新余市',
                                'area' =>
                                    array(
                                        0 => '渝水区',
                                        1 => '分宜县',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '鹰潭市',
                                'area' =>
                                    array(
                                        0 => '月湖区',
                                        1 => '余江县',
                                        2 => '贵溪市',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '赣州市',
                                'area' =>
                                    array(
                                        0 => '章贡区',
                                        1 => '赣　县',
                                        2 => '信丰县',
                                        3 => '大余县',
                                        4 => '上犹县',
                                        5 => '崇义县',
                                        6 => '安远县',
                                        7 => '龙南县',
                                        8 => '定南县',
                                        9 => '全南县',
                                        10 => '宁都县',
                                        11 => '于都县',
                                        12 => '兴国县',
                                        13 => '会昌县',
                                        14 => '寻乌县',
                                        15 => '石城县',
                                        16 => '瑞金市',
                                        17 => '南康市',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '吉安市',
                                'area' =>
                                    array(
                                        0 => '吉州区',
                                        1 => '青原区',
                                        2 => '吉安县',
                                        3 => '吉水县',
                                        4 => '峡江县',
                                        5 => '新干县',
                                        6 => '永丰县',
                                        7 => '泰和县',
                                        8 => '遂川县',
                                        9 => '万安县',
                                        10 => '安福县',
                                        11 => '永新县',
                                        12 => '井冈山市',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '宜春市',
                                'area' =>
                                    array(
                                        0 => '袁州区',
                                        1 => '奉新县',
                                        2 => '万载县',
                                        3 => '上高县',
                                        4 => '宜丰县',
                                        5 => '靖安县',
                                        6 => '铜鼓县',
                                        7 => '丰城市',
                                        8 => '樟树市',
                                        9 => '高安市',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '抚州市',
                                'area' =>
                                    array(
                                        0 => '临川区',
                                        1 => '南城县',
                                        2 => '黎川县',
                                        3 => '南丰县',
                                        4 => '崇仁县',
                                        5 => '乐安县',
                                        6 => '宜黄县',
                                        7 => '金溪县',
                                        8 => '资溪县',
                                        9 => '东乡县',
                                        10 => '广昌县',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '上饶市',
                                'area' =>
                                    array(
                                        0 => '信州区',
                                        1 => '上饶县',
                                        2 => '广丰县',
                                        3 => '玉山县',
                                        4 => '铅山县',
                                        5 => '横峰县',
                                        6 => '弋阳县',
                                        7 => '余干县',
                                        8 => '鄱阳县',
                                        9 => '万年县',
                                        10 => '婺源县',
                                        11 => '德兴市',
                                    ),
                            ),
                    ),
            ),
        14 =>
            array(
                'province_name' => '山东省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '济南市',
                                'area' =>
                                    array(
                                        0 => '历下区',
                                        1 => '市中区',
                                        2 => '槐荫区',
                                        3 => '天桥区',
                                        4 => '历城区',
                                        5 => '长清区',
                                        6 => '平阴县',
                                        7 => '济阳县',
                                        8 => '商河县',
                                        9 => '章丘市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '青岛市',
                                'area' =>
                                    array(
                                        0 => '市南区',
                                        1 => '市北区',
                                        2 => '四方区',
                                        3 => '黄岛区',
                                        4 => '崂山区',
                                        5 => '李沧区',
                                        6 => '城阳区',
                                        7 => '胶州市',
                                        8 => '即墨市',
                                        9 => '平度市',
                                        10 => '胶南市',
                                        11 => '莱西市',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '淄博市',
                                'area' =>
                                    array(
                                        0 => '淄川区',
                                        1 => '张店区',
                                        2 => '博山区',
                                        3 => '临淄区',
                                        4 => '周村区',
                                        5 => '桓台县',
                                        6 => '高青县',
                                        7 => '沂源县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '枣庄市',
                                'area' =>
                                    array(
                                        0 => '市中区',
                                        1 => '薛城区',
                                        2 => '峄城区',
                                        3 => '台儿庄区',
                                        4 => '山亭区',
                                        5 => '滕州市',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '东营市',
                                'area' =>
                                    array(
                                        0 => '东营区',
                                        1 => '河口区',
                                        2 => '垦利县',
                                        3 => '利津县',
                                        4 => '广饶县',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '烟台市',
                                'area' =>
                                    array(
                                        0 => '芝罘区',
                                        1 => '福山区',
                                        2 => '牟平区',
                                        3 => '莱山区',
                                        4 => '长岛县',
                                        5 => '龙口市',
                                        6 => '莱阳市',
                                        7 => '莱州市',
                                        8 => '蓬莱市',
                                        9 => '招远市',
                                        10 => '栖霞市',
                                        11 => '海阳市',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '潍坊市',
                                'area' =>
                                    array(
                                        0 => '潍城区',
                                        1 => '寒亭区',
                                        2 => '坊子区',
                                        3 => '奎文区',
                                        4 => '临朐县',
                                        5 => '昌乐县',
                                        6 => '青州市',
                                        7 => '诸城市',
                                        8 => '寿光市',
                                        9 => '安丘市',
                                        10 => '高密市',
                                        11 => '昌邑市',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '济宁市',
                                'area' =>
                                    array(
                                        0 => '市中区',
                                        1 => '任城区',
                                        2 => '微山县',
                                        3 => '鱼台县',
                                        4 => '金乡县',
                                        5 => '嘉祥县',
                                        6 => '汶上县',
                                        7 => '泗水县',
                                        8 => '梁山县',
                                        9 => '曲阜市',
                                        10 => '兖州市',
                                        11 => '邹城市',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '泰安市',
                                'area' =>
                                    array(
                                        0 => '泰山区',
                                        1 => '岱岳区',
                                        2 => '宁阳县',
                                        3 => '东平县',
                                        4 => '新泰市',
                                        5 => '肥城市',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '威海市',
                                'area' =>
                                    array(
                                        0 => '环翠区',
                                        1 => '文登市',
                                        2 => '荣成市',
                                        3 => '乳山市',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '日照市',
                                'area' =>
                                    array(
                                        0 => '东港区',
                                        1 => '岚山区',
                                        2 => '五莲县',
                                        3 => '莒　县',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '莱芜市',
                                'area' =>
                                    array(
                                        0 => '莱城区',
                                        1 => '钢城区',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '临沂市',
                                'area' =>
                                    array(
                                        0 => '兰山区',
                                        1 => '罗庄区',
                                        2 => '河东区',
                                        3 => '沂南县',
                                        4 => '郯城县',
                                        5 => '沂水县',
                                        6 => '苍山县',
                                        7 => '费　县',
                                        8 => '平邑县',
                                        9 => '莒南县',
                                        10 => '蒙阴县',
                                        11 => '临沭县',
                                    ),
                            ),
                        13 =>
                            array(
                                'city_name' => '德州市',
                                'area' =>
                                    array(
                                        0 => '德城区',
                                        1 => '陵　县',
                                        2 => '宁津县',
                                        3 => '庆云县',
                                        4 => '临邑县',
                                        5 => '齐河县',
                                        6 => '平原县',
                                        7 => '夏津县',
                                        8 => '武城县',
                                        9 => '乐陵市',
                                        10 => '禹城市',
                                    ),
                            ),
                        14 =>
                            array(
                                'city_name' => '聊城市',
                                'area' =>
                                    array(
                                        0 => '东昌府区',
                                        1 => '阳谷县',
                                        2 => '莘　县',
                                        3 => '茌平县',
                                        4 => '东阿县',
                                        5 => '冠　县',
                                        6 => '高唐县',
                                        7 => '临清市',
                                    ),
                            ),
                        15 =>
                            array(
                                'city_name' => '滨州市',
                                'area' =>
                                    array(
                                        0 => '滨城区',
                                        1 => '惠民县',
                                        2 => '阳信县',
                                        3 => '无棣县',
                                        4 => '沾化县',
                                        5 => '博兴县',
                                        6 => '邹平县',
                                    ),
                            ),
                        16 =>
                            array(
                                'city_name' => '荷泽市',
                                'area' =>
                                    array(
                                        0 => '牡丹区',
                                        1 => '曹　县',
                                        2 => '单　县',
                                        3 => '成武县',
                                        4 => '巨野县',
                                        5 => '郓城县',
                                        6 => '鄄城县',
                                        7 => '定陶县',
                                        8 => '东明县',
                                    ),
                            ),
                    ),
            ),
        15 =>
            array(
                'province_name' => '河南省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '郑州市',
                                'area' =>
                                    array(
                                        0 => '中原区',
                                        1 => '二七区',
                                        2 => '管城回族区',
                                        3 => '金水区',
                                        4 => '上街区',
                                        5 => '邙山区',
                                        6 => '中牟县',
                                        7 => '巩义市',
                                        8 => '荥阳市',
                                        9 => '新密市',
                                        10 => '新郑市',
                                        11 => '登封市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '开封市',
                                'area' =>
                                    array(
                                        0 => '龙亭区',
                                        1 => '顺河回族区',
                                        2 => '鼓楼区',
                                        3 => '南关区',
                                        4 => '郊　区',
                                        5 => '杞　县',
                                        6 => '通许县',
                                        7 => '尉氏县',
                                        8 => '开封县',
                                        9 => '兰考县',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '洛阳市',
                                'area' =>
                                    array(
                                        0 => '老城区',
                                        1 => '西工区',
                                        2 => '廛河回族区',
                                        3 => '涧西区',
                                        4 => '吉利区',
                                        5 => '洛龙区',
                                        6 => '孟津县',
                                        7 => '新安县',
                                        8 => '栾川县',
                                        9 => '嵩　县',
                                        10 => '汝阳县',
                                        11 => '宜阳县',
                                        12 => '洛宁县',
                                        13 => '伊川县',
                                        14 => '偃师市',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '平顶山市',
                                'area' =>
                                    array(
                                        0 => '新华区',
                                        1 => '卫东区',
                                        2 => '石龙区',
                                        3 => '湛河区',
                                        4 => '宝丰县',
                                        5 => '叶　县',
                                        6 => '鲁山县',
                                        7 => '郏　县',
                                        8 => '舞钢市',
                                        9 => '汝州市',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '安阳市',
                                'area' =>
                                    array(
                                        0 => '文峰区',
                                        1 => '北关区',
                                        2 => '殷都区',
                                        3 => '龙安区',
                                        4 => '安阳县',
                                        5 => '汤阴县',
                                        6 => '滑　县',
                                        7 => '内黄县',
                                        8 => '林州市',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '鹤壁市',
                                'area' =>
                                    array(
                                        0 => '鹤山区',
                                        1 => '山城区',
                                        2 => '淇滨区',
                                        3 => '浚　县',
                                        4 => '淇　县',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '新乡市',
                                'area' =>
                                    array(
                                        0 => '红旗区',
                                        1 => '卫滨区',
                                        2 => '凤泉区',
                                        3 => '牧野区',
                                        4 => '新乡县',
                                        5 => '获嘉县',
                                        6 => '原阳县',
                                        7 => '延津县',
                                        8 => '封丘县',
                                        9 => '长垣县',
                                        10 => '卫辉市',
                                        11 => '辉县市',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '焦作市',
                                'area' =>
                                    array(
                                        0 => '解放区',
                                        1 => '中站区',
                                        2 => '马村区',
                                        3 => '山阳区',
                                        4 => '修武县',
                                        5 => '博爱县',
                                        6 => '武陟县',
                                        7 => '温　县',
                                        8 => '济源市',
                                        9 => '沁阳市',
                                        10 => '孟州市',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '濮阳市',
                                'area' =>
                                    array(
                                        0 => '华龙区',
                                        1 => '清丰县',
                                        2 => '南乐县',
                                        3 => '范　县',
                                        4 => '台前县',
                                        5 => '濮阳县',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '许昌市',
                                'area' =>
                                    array(
                                        0 => '魏都区',
                                        1 => '许昌县',
                                        2 => '鄢陵县',
                                        3 => '襄城县',
                                        4 => '禹州市',
                                        5 => '长葛市',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '漯河市',
                                'area' =>
                                    array(
                                        0 => '源汇区',
                                        1 => '郾城区',
                                        2 => '召陵区',
                                        3 => '舞阳县',
                                        4 => '临颍县',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '三门峡市',
                                'area' =>
                                    array(
                                        0 => '湖滨区',
                                        1 => '渑池县',
                                        2 => '陕　县',
                                        3 => '卢氏县',
                                        4 => '义马市',
                                        5 => '灵宝市',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '南阳市',
                                'area' =>
                                    array(
                                        0 => '宛城区',
                                        1 => '卧龙区',
                                        2 => '南召县',
                                        3 => '方城县',
                                        4 => '西峡县',
                                        5 => '镇平县',
                                        6 => '内乡县',
                                        7 => '淅川县',
                                        8 => '社旗县',
                                        9 => '唐河县',
                                        10 => '新野县',
                                        11 => '桐柏县',
                                        12 => '邓州市',
                                    ),
                            ),
                        13 =>
                            array(
                                'city_name' => '商丘市',
                                'area' =>
                                    array(
                                        0 => '梁园区',
                                        1 => '睢阳区',
                                        2 => '民权县',
                                        3 => '睢　县',
                                        4 => '宁陵县',
                                        5 => '柘城县',
                                        6 => '虞城县',
                                        7 => '夏邑县',
                                        8 => '永城市',
                                    ),
                            ),
                        14 =>
                            array(
                                'city_name' => '信阳市',
                                'area' =>
                                    array(
                                        0 => '师河区',
                                        1 => '平桥区',
                                        2 => '罗山县',
                                        3 => '光山县',
                                        4 => '新　县',
                                        5 => '商城县',
                                        6 => '固始县',
                                        7 => '潢川县',
                                        8 => '淮滨县',
                                        9 => '息　县',
                                    ),
                            ),
                        15 =>
                            array(
                                'city_name' => '周口市',
                                'area' =>
                                    array(
                                        0 => '川汇区',
                                        1 => '扶沟县',
                                        2 => '西华县',
                                        3 => '商水县',
                                        4 => '沈丘县',
                                        5 => '郸城县',
                                        6 => '淮阳县',
                                        7 => '太康县',
                                        8 => '鹿邑县',
                                        9 => '项城市',
                                    ),
                            ),
                        16 =>
                            array(
                                'city_name' => '驻马店市',
                                'area' =>
                                    array(
                                        0 => '驿城区',
                                        1 => '西平县',
                                        2 => '上蔡县',
                                        3 => '平舆县',
                                        4 => '正阳县',
                                        5 => '确山县',
                                        6 => '泌阳县',
                                        7 => '汝南县',
                                        8 => '遂平县',
                                        9 => '新蔡县',
                                    ),
                            ),
                    ),
            ),
        16 =>
            array(
                'province_name' => '湖北省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '武汉市',
                                'area' =>
                                    array(
                                        0 => '江岸区',
                                        1 => '江汉区',
                                        2 => '乔口区',
                                        3 => '汉阳区',
                                        4 => '武昌区',
                                        5 => '青山区',
                                        6 => '洪山区',
                                        7 => '东西湖区',
                                        8 => '汉南区',
                                        9 => '蔡甸区',
                                        10 => '江夏区',
                                        11 => '黄陂区',
                                        12 => '新洲区',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '黄石市',
                                'area' =>
                                    array(
                                        0 => '黄石港区',
                                        1 => '西塞山区',
                                        2 => '下陆区',
                                        3 => '铁山区',
                                        4 => '阳新县',
                                        5 => '大冶市',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '十堰市',
                                'area' =>
                                    array(
                                        0 => '茅箭区',
                                        1 => '张湾区',
                                        2 => '郧　县',
                                        3 => '郧西县',
                                        4 => '竹山县',
                                        5 => '竹溪县',
                                        6 => '房　县',
                                        7 => '丹江口市',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '宜昌市',
                                'area' =>
                                    array(
                                        0 => '西陵区',
                                        1 => '伍家岗区',
                                        2 => '点军区',
                                        3 => '猇亭区',
                                        4 => '夷陵区',
                                        5 => '远安县',
                                        6 => '兴山县',
                                        7 => '秭归县',
                                        8 => '长阳土家族自治县',
                                        9 => '五峰土家族自治县',
                                        10 => '宜都市',
                                        11 => '当阳市',
                                        12 => '枝江市',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '襄樊市',
                                'area' =>
                                    array(
                                        0 => '襄城区',
                                        1 => '樊城区',
                                        2 => '襄阳区',
                                        3 => '南漳县',
                                        4 => '谷城县',
                                        5 => '保康县',
                                        6 => '老河口市',
                                        7 => '枣阳市',
                                        8 => '宜城市',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '鄂州市',
                                'area' =>
                                    array(
                                        0 => '梁子湖区',
                                        1 => '华容区',
                                        2 => '鄂城区',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '荆门市',
                                'area' =>
                                    array(
                                        0 => '东宝区',
                                        1 => '掇刀区',
                                        2 => '京山县',
                                        3 => '沙洋县',
                                        4 => '钟祥市',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '孝感市',
                                'area' =>
                                    array(
                                        0 => '孝南区',
                                        1 => '孝昌县',
                                        2 => '大悟县',
                                        3 => '云梦县',
                                        4 => '应城市',
                                        5 => '安陆市',
                                        6 => '汉川市',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '荆州市',
                                'area' =>
                                    array(
                                        0 => '沙市区',
                                        1 => '荆州区',
                                        2 => '公安县',
                                        3 => '监利县',
                                        4 => '江陵县',
                                        5 => '石首市',
                                        6 => '洪湖市',
                                        7 => '松滋市',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '黄冈市',
                                'area' =>
                                    array(
                                        0 => '黄州区',
                                        1 => '团风县',
                                        2 => '红安县',
                                        3 => '罗田县',
                                        4 => '英山县',
                                        5 => '浠水县',
                                        6 => '蕲春县',
                                        7 => '黄梅县',
                                        8 => '麻城市',
                                        9 => '武穴市',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '咸宁市',
                                'area' =>
                                    array(
                                        0 => '咸安区',
                                        1 => '嘉鱼县',
                                        2 => '通城县',
                                        3 => '崇阳县',
                                        4 => '通山县',
                                        5 => '赤壁市',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '随州市',
                                'area' =>
                                    array(
                                        0 => '曾都区',
                                        1 => '广水市',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '恩施土家族苗族自治州',
                                'area' =>
                                    array(
                                        0 => '恩施市',
                                        1 => '利川市',
                                        2 => '建始县',
                                        3 => '巴东县',
                                        4 => '宣恩县',
                                        5 => '咸丰县',
                                        6 => '来凤县',
                                        7 => '鹤峰县',
                                    ),
                            ),
                        13 =>
                            array(
                                'city_name' => '省直辖行政单位',
                                'area' =>
                                    array(
                                        0 => '仙桃市',
                                        1 => '潜江市',
                                        2 => '天门市',
                                        3 => '神农架林区',
                                    ),
                            ),
                    ),
            ),
        17 =>
            array(
                'province_name' => '湖南省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '长沙市',
                                'area' =>
                                    array(
                                        0 => '芙蓉区',
                                        1 => '天心区',
                                        2 => '岳麓区',
                                        3 => '开福区',
                                        4 => '雨花区',
                                        5 => '长沙县',
                                        6 => '望城县',
                                        7 => '宁乡县',
                                        8 => '浏阳市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '株洲市',
                                'area' =>
                                    array(
                                        0 => '荷塘区',
                                        1 => '芦淞区',
                                        2 => '石峰区',
                                        3 => '天元区',
                                        4 => '株洲县',
                                        5 => '攸　县',
                                        6 => '茶陵县',
                                        7 => '炎陵县',
                                        8 => '醴陵市',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '湘潭市',
                                'area' =>
                                    array(
                                        0 => '雨湖区',
                                        1 => '岳塘区',
                                        2 => '湘潭县',
                                        3 => '湘乡市',
                                        4 => '韶山市',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '衡阳市',
                                'area' =>
                                    array(
                                        0 => '珠晖区',
                                        1 => '雁峰区',
                                        2 => '石鼓区',
                                        3 => '蒸湘区',
                                        4 => '南岳区',
                                        5 => '衡阳县',
                                        6 => '衡南县',
                                        7 => '衡山县',
                                        8 => '衡东县',
                                        9 => '祁东县',
                                        10 => '耒阳市',
                                        11 => '常宁市',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '邵阳市',
                                'area' =>
                                    array(
                                        0 => '双清区',
                                        1 => '大祥区',
                                        2 => '北塔区',
                                        3 => '邵东县',
                                        4 => '新邵县',
                                        5 => '邵阳县',
                                        6 => '隆回县',
                                        7 => '洞口县',
                                        8 => '绥宁县',
                                        9 => '新宁县',
                                        10 => '城步苗族自治县',
                                        11 => '武冈市',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '岳阳市',
                                'area' =>
                                    array(
                                        0 => '岳阳楼区',
                                        1 => '云溪区',
                                        2 => '君山区',
                                        3 => '岳阳县',
                                        4 => '华容县',
                                        5 => '湘阴县',
                                        6 => '平江县',
                                        7 => '汨罗市',
                                        8 => '临湘市',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '常德市',
                                'area' =>
                                    array(
                                        0 => '武陵区',
                                        1 => '鼎城区',
                                        2 => '安乡县',
                                        3 => '汉寿县',
                                        4 => '澧　县',
                                        5 => '临澧县',
                                        6 => '桃源县',
                                        7 => '石门县',
                                        8 => '津市市',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '张家界市',
                                'area' =>
                                    array(
                                        0 => '永定区',
                                        1 => '武陵源区',
                                        2 => '慈利县',
                                        3 => '桑植县',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '益阳市',
                                'area' =>
                                    array(
                                        0 => '资阳区',
                                        1 => '赫山区',
                                        2 => '南　县',
                                        3 => '桃江县',
                                        4 => '安化县',
                                        5 => '沅江市',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '郴州市',
                                'area' =>
                                    array(
                                        0 => '北湖区',
                                        1 => '苏仙区',
                                        2 => '桂阳县',
                                        3 => '宜章县',
                                        4 => '永兴县',
                                        5 => '嘉禾县',
                                        6 => '临武县',
                                        7 => '汝城县',
                                        8 => '桂东县',
                                        9 => '安仁县',
                                        10 => '资兴市',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '永州市',
                                'area' =>
                                    array(
                                        0 => '芝山区',
                                        1 => '冷水滩区',
                                        2 => '祁阳县',
                                        3 => '东安县',
                                        4 => '双牌县',
                                        5 => '道　县',
                                        6 => '江永县',
                                        7 => '宁远县',
                                        8 => '蓝山县',
                                        9 => '新田县',
                                        10 => '江华瑶族自治县',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '怀化市',
                                'area' =>
                                    array(
                                        0 => '鹤城区',
                                        1 => '中方县',
                                        2 => '沅陵县',
                                        3 => '辰溪县',
                                        4 => '溆浦县',
                                        5 => '会同县',
                                        6 => '麻阳苗族自治县',
                                        7 => '新晃侗族自治县',
                                        8 => '芷江侗族自治县',
                                        9 => '靖州苗族侗族自治县',
                                        10 => '通道侗族自治县',
                                        11 => '洪江市',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '娄底市',
                                'area' =>
                                    array(
                                        0 => '娄星区',
                                        1 => '双峰县',
                                        2 => '新化县',
                                        3 => '冷水江市',
                                        4 => '涟源市',
                                    ),
                            ),
                        13 =>
                            array(
                                'city_name' => '湘西土家族苗族自治州',
                                'area' =>
                                    array(
                                        0 => '吉首市',
                                        1 => '泸溪县',
                                        2 => '凤凰县',
                                        3 => '花垣县',
                                        4 => '保靖县',
                                        5 => '古丈县',
                                        6 => '永顺县',
                                        7 => '龙山县',
                                    ),
                            ),
                    ),
            ),
        18 =>
            array(
                'province_name' => '广东省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '广州市',
                                'area' =>
                                    array(
                                        0 => '东山区',
                                        1 => '荔湾区',
                                        2 => '越秀区',
                                        3 => '海珠区',
                                        4 => '天河区',
                                        5 => '芳村区',
                                        6 => '白云区',
                                        7 => '黄埔区',
                                        8 => '番禺区',
                                        9 => '花都区',
                                        10 => '增城市',
                                        11 => '从化市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '韶关市',
                                'area' =>
                                    array(
                                        0 => '武江区',
                                        1 => '浈江区',
                                        2 => '曲江区',
                                        3 => '始兴县',
                                        4 => '仁化县',
                                        5 => '翁源县',
                                        6 => '乳源瑶族自治县',
                                        7 => '新丰县',
                                        8 => '乐昌市',
                                        9 => '南雄市',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '深圳市',
                                'area' =>
                                    array(
                                        0 => '罗湖区',
                                        1 => '福田区',
                                        2 => '南山区',
                                        3 => '宝安区',
                                        4 => '龙岗区',
                                        5 => '盐田区',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '珠海市',
                                'area' =>
                                    array(
                                        0 => '香洲区',
                                        1 => '斗门区',
                                        2 => '金湾区',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '汕头市',
                                'area' =>
                                    array(
                                        0 => '龙湖区',
                                        1 => '金平区',
                                        2 => '濠江区',
                                        3 => '潮阳区',
                                        4 => '潮南区',
                                        5 => '澄海区',
                                        6 => '南澳县',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '佛山市',
                                'area' =>
                                    array(
                                        0 => '禅城区',
                                        1 => '南海区',
                                        2 => '顺德区',
                                        3 => '三水区',
                                        4 => '高明区',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '江门市',
                                'area' =>
                                    array(
                                        0 => '蓬江区',
                                        1 => '江海区',
                                        2 => '新会区',
                                        3 => '台山市',
                                        4 => '开平市',
                                        5 => '鹤山市',
                                        6 => '恩平市',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '湛江市',
                                'area' =>
                                    array(
                                        0 => '赤坎区',
                                        1 => '霞山区',
                                        2 => '坡头区',
                                        3 => '麻章区',
                                        4 => '遂溪县',
                                        5 => '徐闻县',
                                        6 => '廉江市',
                                        7 => '雷州市',
                                        8 => '吴川市',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '茂名市',
                                'area' =>
                                    array(
                                        0 => '茂南区',
                                        1 => '茂港区',
                                        2 => '电白县',
                                        3 => '高州市',
                                        4 => '化州市',
                                        5 => '信宜市',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '肇庆市',
                                'area' =>
                                    array(
                                        0 => '端州区',
                                        1 => '鼎湖区',
                                        2 => '广宁县',
                                        3 => '怀集县',
                                        4 => '封开县',
                                        5 => '德庆县',
                                        6 => '高要市',
                                        7 => '四会市',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '惠州市',
                                'area' =>
                                    array(
                                        0 => '惠城区',
                                        1 => '惠阳区',
                                        2 => '博罗县',
                                        3 => '惠东县',
                                        4 => '龙门县',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '梅州市',
                                'area' =>
                                    array(
                                        0 => '梅江区',
                                        1 => '梅　县',
                                        2 => '大埔县',
                                        3 => '丰顺县',
                                        4 => '五华县',
                                        5 => '平远县',
                                        6 => '蕉岭县',
                                        7 => '兴宁市',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '汕尾市',
                                'area' =>
                                    array(
                                        0 => '城　区',
                                        1 => '海丰县',
                                        2 => '陆河县',
                                        3 => '陆丰市',
                                    ),
                            ),
                        13 =>
                            array(
                                'city_name' => '河源市',
                                'area' =>
                                    array(
                                        0 => '源城区',
                                        1 => '紫金县',
                                        2 => '龙川县',
                                        3 => '连平县',
                                        4 => '和平县',
                                        5 => '东源县',
                                    ),
                            ),
                        14 =>
                            array(
                                'city_name' => '阳江市',
                                'area' =>
                                    array(
                                        0 => '江城区',
                                        1 => '阳西县',
                                        2 => '阳东县',
                                        3 => '阳春市',
                                    ),
                            ),
                        15 =>
                            array(
                                'city_name' => '清远市',
                                'area' =>
                                    array(
                                        0 => '清城区',
                                        1 => '佛冈县',
                                        2 => '阳山县',
                                        3 => '连山壮族瑶族自治县',
                                        4 => '连南瑶族自治县',
                                        5 => '清新县',
                                        6 => '英德市',
                                        7 => '连州市',
                                    ),
                            ),
                        16 =>
                            array(
                                'city_name' => '东莞市',
                            ),
                        17 =>
                            array(
                                'city_name' => '中山市',
                            ),
                        18 =>
                            array(
                                'city_name' => '潮州市',
                                'area' =>
                                    array(
                                        0 => '湘桥区',
                                        1 => '潮安县',
                                        2 => '饶平县',
                                    ),
                            ),
                        19 =>
                            array(
                                'city_name' => '揭阳市',
                                'area' =>
                                    array(
                                        0 => '榕城区',
                                        1 => '揭东县',
                                        2 => '揭西县',
                                        3 => '惠来县',
                                        4 => '普宁市',
                                    ),
                            ),
                        20 =>
                            array(
                                'city_name' => '云浮市',
                                'area' =>
                                    array(
                                        0 => '云城区',
                                        1 => '新兴县',
                                        2 => '郁南县',
                                        3 => '云安县',
                                        4 => '罗定市',
                                    ),
                            ),
                    ),
            ),
        19 =>
            array(
                'province_name' => '广西壮族自治区',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '南宁市',
                                'area' =>
                                    array(
                                        0 => '兴宁区',
                                        1 => '青秀区',
                                        2 => '江南区',
                                        3 => '西乡塘区',
                                        4 => '良庆区',
                                        5 => '邕宁区',
                                        6 => '武鸣县',
                                        7 => '隆安县',
                                        8 => '马山县',
                                        9 => '上林县',
                                        10 => '宾阳县',
                                        11 => '横　县',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '柳州市',
                                'area' =>
                                    array(
                                        0 => '城中区',
                                        1 => '鱼峰区',
                                        2 => '柳南区',
                                        3 => '柳北区',
                                        4 => '柳江县',
                                        5 => '柳城县',
                                        6 => '鹿寨县',
                                        7 => '融安县',
                                        8 => '融水苗族自治县',
                                        9 => '三江侗族自治县',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '桂林市',
                                'area' =>
                                    array(
                                        0 => '秀峰区',
                                        1 => '叠彩区',
                                        2 => '象山区',
                                        3 => '七星区',
                                        4 => '雁山区',
                                        5 => '阳朔县',
                                        6 => '临桂县',
                                        7 => '灵川县',
                                        8 => '全州县',
                                        9 => '兴安县',
                                        10 => '永福县',
                                        11 => '灌阳县',
                                        12 => '龙胜各族自治县',
                                        13 => '资源县',
                                        14 => '平乐县',
                                        15 => '荔蒲县',
                                        16 => '恭城瑶族自治县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '梧州市',
                                'area' =>
                                    array(
                                        0 => '万秀区',
                                        1 => '蝶山区',
                                        2 => '长洲区',
                                        3 => '苍梧县',
                                        4 => '藤　县',
                                        5 => '蒙山县',
                                        6 => '岑溪市',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '北海市',
                                'area' =>
                                    array(
                                        0 => '海城区',
                                        1 => '银海区',
                                        2 => '铁山港区',
                                        3 => '合浦县',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '防城港市',
                                'area' =>
                                    array(
                                        0 => '港口区',
                                        1 => '防城区',
                                        2 => '上思县',
                                        3 => '东兴市',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '钦州市',
                                'area' =>
                                    array(
                                        0 => '钦南区',
                                        1 => '钦北区',
                                        2 => '灵山县',
                                        3 => '浦北县',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '贵港市',
                                'area' =>
                                    array(
                                        0 => '港北区',
                                        1 => '港南区',
                                        2 => '覃塘区',
                                        3 => '平南县',
                                        4 => '桂平市',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '玉林市',
                                'area' =>
                                    array(
                                        0 => '玉州区',
                                        1 => '容　县',
                                        2 => '陆川县',
                                        3 => '博白县',
                                        4 => '兴业县',
                                        5 => '北流市',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '百色市',
                                'area' =>
                                    array(
                                        0 => '右江区',
                                        1 => '田阳县',
                                        2 => '田东县',
                                        3 => '平果县',
                                        4 => '德保县',
                                        5 => '靖西县',
                                        6 => '那坡县',
                                        7 => '凌云县',
                                        8 => '乐业县',
                                        9 => '田林县',
                                        10 => '西林县',
                                        11 => '隆林各族自治县',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '贺州市',
                                'area' =>
                                    array(
                                        0 => '八步区',
                                        1 => '昭平县',
                                        2 => '钟山县',
                                        3 => '富川瑶族自治县',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '河池市',
                                'area' =>
                                    array(
                                        0 => '金城江区',
                                        1 => '南丹县',
                                        2 => '天峨县',
                                        3 => '凤山县',
                                        4 => '东兰县',
                                        5 => '罗城仫佬族自治县',
                                        6 => '环江毛南族自治县',
                                        7 => '巴马瑶族自治县',
                                        8 => '都安瑶族自治县',
                                        9 => '大化瑶族自治县',
                                        10 => '宜州市',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '来宾市',
                                'area' =>
                                    array(
                                        0 => '兴宾区',
                                        1 => '忻城县',
                                        2 => '象州县',
                                        3 => '武宣县',
                                        4 => '金秀瑶族自治县',
                                        5 => '合山市',
                                    ),
                            ),
                        13 =>
                            array(
                                'city_name' => '崇左市',
                                'area' =>
                                    array(
                                        0 => '江洲区',
                                        1 => '扶绥县',
                                        2 => '宁明县',
                                        3 => '龙州县',
                                        4 => '大新县',
                                        5 => '天等县',
                                        6 => '凭祥市',
                                    ),
                            ),
                    ),
            ),
        20 =>
            array(
                'province_name' => '海南省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '海口市',
                                'area' =>
                                    array(
                                        0 => '秀英区',
                                        1 => '龙华区',
                                        2 => '琼山区',
                                        3 => '美兰区',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '三亚市',
                            ),
                        2 =>
                            array(
                                'city_name' => '省直辖县级行政单位',
                                'area' =>
                                    array(
                                        0 => '五指山市',
                                        1 => '琼海市',
                                        2 => '儋州市',
                                        3 => '文昌市',
                                        4 => '万宁市',
                                        5 => '东方市',
                                        6 => '定安县',
                                        7 => '屯昌县',
                                        8 => '澄迈县',
                                        9 => '临高县',
                                        10 => '白沙黎族自治县',
                                        11 => '昌江黎族自治县',
                                        12 => '乐东黎族自治县',
                                        13 => '陵水黎族自治县',
                                        14 => '保亭黎族苗族自治县',
                                        15 => '琼中黎族苗族自治县',
                                        16 => '西沙群岛',
                                        17 => '南沙群岛',
                                        18 => '中沙群岛的岛礁及其海域',
                                    ),
                            ),
                    ),
            ),
        21 =>
            array(
                'province_name' => '重庆市',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '市辖区',
                                'area' =>
                                    array(
                                        0 => '万州区',
                                        1 => '涪陵区',
                                        2 => '渝中区',
                                        3 => '大渡口区',
                                        4 => '江北区',
                                        5 => '沙坪坝区',
                                        6 => '九龙坡区',
                                        7 => '南岸区',
                                        8 => '北碚区',
                                        9 => '万盛区',
                                        10 => '双桥区',
                                        11 => '渝北区',
                                        12 => '巴南区',
                                        13 => '黔江区',
                                        14 => '长寿区',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '重庆周边',
                                'area' =>
                                    array(
                                        0 => '綦江县',
                                        1 => '潼南县',
                                        2 => '铜梁县',
                                        3 => '大足县',
                                        4 => '荣昌县',
                                        5 => '璧山县',
                                        6 => '梁平县',
                                        7 => '城口县',
                                        8 => '丰都县',
                                        9 => '垫江县',
                                        10 => '武隆县',
                                        11 => '忠　县',
                                        12 => '开　县',
                                        13 => '云阳县',
                                        14 => '奉节县',
                                        15 => '巫山县',
                                        16 => '巫溪县',
                                        17 => '石柱土家族自治县',
                                        18 => '秀山土家族苗族自治县',
                                        19 => '酉阳土家族苗族自治县',
                                        20 => '彭水苗族土家族自治县',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '市',
                                'area' =>
                                    array(
                                        0 => '江津市',
                                        1 => '合川市',
                                        2 => '永川市',
                                        3 => '南川市',
                                    ),
                            ),
                    ),
            ),
        22 =>
            array(
                'province_name' => '四川省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '成都市',
                                'area' =>
                                    array(
                                        0 => '锦江区',
                                        1 => '青羊区',
                                        2 => '金牛区',
                                        3 => '武侯区',
                                        4 => '成华区',
                                        5 => '龙泉驿区',
                                        6 => '青白江区',
                                        7 => '新都区',
                                        8 => '温江区',
                                        9 => '金堂县',
                                        10 => '双流县',
                                        11 => '郫　县',
                                        12 => '大邑县',
                                        13 => '蒲江县',
                                        14 => '新津县',
                                        15 => '都江堰市',
                                        16 => '彭州市',
                                        17 => '邛崃市',
                                        18 => '崇州市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '自贡市',
                                'area' =>
                                    array(
                                        0 => '自流井区',
                                        1 => '贡井区',
                                        2 => '大安区',
                                        3 => '沿滩区',
                                        4 => '荣　县',
                                        5 => '富顺县',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '攀枝花市',
                                'area' =>
                                    array(
                                        0 => '东　区',
                                        1 => '西　区',
                                        2 => '仁和区',
                                        3 => '米易县',
                                        4 => '盐边县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '泸州市',
                                'area' =>
                                    array(
                                        0 => '江阳区',
                                        1 => '纳溪区',
                                        2 => '龙马潭区',
                                        3 => '泸　县',
                                        4 => '合江县',
                                        5 => '叙永县',
                                        6 => '古蔺县',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '德阳市',
                                'area' =>
                                    array(
                                        0 => '旌阳区',
                                        1 => '中江县',
                                        2 => '罗江县',
                                        3 => '广汉市',
                                        4 => '什邡市',
                                        5 => '绵竹市',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '绵阳市',
                                'area' =>
                                    array(
                                        0 => '涪城区',
                                        1 => '游仙区',
                                        2 => '三台县',
                                        3 => '盐亭县',
                                        4 => '安　县',
                                        5 => '梓潼县',
                                        6 => '北川羌族自治县',
                                        7 => '平武县',
                                        8 => '江油市',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '广元市',
                                'area' =>
                                    array(
                                        0 => '市中区',
                                        1 => '元坝区',
                                        2 => '朝天区',
                                        3 => '旺苍县',
                                        4 => '青川县',
                                        5 => '剑阁县',
                                        6 => '苍溪县',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '遂宁市',
                                'area' =>
                                    array(
                                        0 => '船山区',
                                        1 => '安居区',
                                        2 => '蓬溪县',
                                        3 => '射洪县',
                                        4 => '大英县',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '内江市',
                                'area' =>
                                    array(
                                        0 => '市中区',
                                        1 => '东兴区',
                                        2 => '威远县',
                                        3 => '资中县',
                                        4 => '隆昌县',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '乐山市',
                                'area' =>
                                    array(
                                        0 => '市中区',
                                        1 => '沙湾区',
                                        2 => '五通桥区',
                                        3 => '金口河区',
                                        4 => '犍为县',
                                        5 => '井研县',
                                        6 => '夹江县',
                                        7 => '沐川县',
                                        8 => '峨边彝族自治县',
                                        9 => '马边彝族自治县',
                                        10 => '峨眉山市',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '南充市',
                                'area' =>
                                    array(
                                        0 => '顺庆区',
                                        1 => '高坪区',
                                        2 => '嘉陵区',
                                        3 => '南部县',
                                        4 => '营山县',
                                        5 => '蓬安县',
                                        6 => '仪陇县',
                                        7 => '西充县',
                                        8 => '阆中市',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '眉山市',
                                'area' =>
                                    array(
                                        0 => '东坡区',
                                        1 => '仁寿县',
                                        2 => '彭山县',
                                        3 => '洪雅县',
                                        4 => '丹棱县',
                                        5 => '青神县',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '宜宾市',
                                'area' =>
                                    array(
                                        0 => '翠屏区',
                                        1 => '宜宾县',
                                        2 => '南溪县',
                                        3 => '江安县',
                                        4 => '长宁县',
                                        5 => '高　县',
                                        6 => '珙　县',
                                        7 => '筠连县',
                                        8 => '兴文县',
                                        9 => '屏山县',
                                    ),
                            ),
                        13 =>
                            array(
                                'city_name' => '广安市',
                                'area' =>
                                    array(
                                        0 => '广安区',
                                        1 => '岳池县',
                                        2 => '武胜县',
                                        3 => '邻水县',
                                        4 => '华莹市',
                                    ),
                            ),
                        14 =>
                            array(
                                'city_name' => '达州市',
                                'area' =>
                                    array(
                                        0 => '通川区',
                                        1 => '达　县',
                                        2 => '宣汉县',
                                        3 => '开江县',
                                        4 => '大竹县',
                                        5 => '渠　县',
                                        6 => '万源市',
                                    ),
                            ),
                        15 =>
                            array(
                                'city_name' => '雅安市',
                                'area' =>
                                    array(
                                        0 => '雨城区',
                                        1 => '名山县',
                                        2 => '荥经县',
                                        3 => '汉源县',
                                        4 => '石棉县',
                                        5 => '天全县',
                                        6 => '芦山县',
                                        7 => '宝兴县',
                                    ),
                            ),
                        16 =>
                            array(
                                'city_name' => '巴中市',
                                'area' =>
                                    array(
                                        0 => '巴州区',
                                        1 => '通江县',
                                        2 => '南江县',
                                        3 => '平昌县',
                                    ),
                            ),
                        17 =>
                            array(
                                'city_name' => '资阳市',
                                'area' =>
                                    array(
                                        0 => '雁江区',
                                        1 => '安岳县',
                                        2 => '乐至县',
                                        3 => '简阳市',
                                    ),
                            ),
                        18 =>
                            array(
                                'city_name' => '阿坝藏族羌族自治州',
                                'area' =>
                                    array(
                                        0 => '汶川县',
                                        1 => '理　县',
                                        2 => '茂　县',
                                        3 => '松潘县',
                                        4 => '九寨沟县',
                                        5 => '金川县',
                                        6 => '小金县',
                                        7 => '黑水县',
                                        8 => '马尔康县',
                                        9 => '壤塘县',
                                        10 => '阿坝县',
                                        11 => '若尔盖县',
                                        12 => '红原县',
                                    ),
                            ),
                        19 =>
                            array(
                                'city_name' => '甘孜藏族自治州',
                                'area' =>
                                    array(
                                        0 => '康定县',
                                        1 => '泸定县',
                                        2 => '丹巴县',
                                        3 => '九龙县',
                                        4 => '雅江县',
                                        5 => '道孚县',
                                        6 => '炉霍县',
                                        7 => '甘孜县',
                                        8 => '新龙县',
                                        9 => '德格县',
                                        10 => '白玉县',
                                        11 => '石渠县',
                                        12 => '色达县',
                                        13 => '理塘县',
                                        14 => '巴塘县',
                                        15 => '乡城县',
                                        16 => '稻城县',
                                        17 => '得荣县',
                                    ),
                            ),
                        20 =>
                            array(
                                'city_name' => '凉山彝族自治州',
                                'area' =>
                                    array(
                                        0 => '西昌市',
                                        1 => '木里藏族自治县',
                                        2 => '盐源县',
                                        3 => '德昌县',
                                        4 => '会理县',
                                        5 => '会东县',
                                        6 => '宁南县',
                                        7 => '普格县',
                                        8 => '布拖县',
                                        9 => '金阳县',
                                        10 => '昭觉县',
                                        11 => '喜德县',
                                        12 => '冕宁县',
                                        13 => '越西县',
                                        14 => '甘洛县',
                                        15 => '美姑县',
                                        16 => '雷波县',
                                    ),
                            ),
                    ),
            ),
        23 =>
            array(
                'province_name' => '贵州省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '贵阳市',
                                'area' =>
                                    array(
                                        0 => '南明区',
                                        1 => '云岩区',
                                        2 => '花溪区',
                                        3 => '乌当区',
                                        4 => '白云区',
                                        5 => '小河区',
                                        6 => '开阳县',
                                        7 => '息烽县',
                                        8 => '修文县',
                                        9 => '清镇市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '六盘水市',
                                'area' =>
                                    array(
                                        0 => '钟山区',
                                        1 => '六枝特区',
                                        2 => '水城县',
                                        3 => '盘　县',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '遵义市',
                                'area' =>
                                    array(
                                        0 => '红花岗区',
                                        1 => '汇川区',
                                        2 => '遵义县',
                                        3 => '桐梓县',
                                        4 => '绥阳县',
                                        5 => '正安县',
                                        6 => '道真仡佬族苗族自治县',
                                        7 => '务川仡佬族苗族自治县',
                                        8 => '凤冈县',
                                        9 => '湄潭县',
                                        10 => '余庆县',
                                        11 => '习水县',
                                        12 => '赤水市',
                                        13 => '仁怀市',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '安顺市',
                                'area' =>
                                    array(
                                        0 => '西秀区',
                                        1 => '平坝县',
                                        2 => '普定县',
                                        3 => '镇宁布依族苗族自治县',
                                        4 => '关岭布依族苗族自治县',
                                        5 => '紫云苗族布依族自治县',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '铜仁地区',
                                'area' =>
                                    array(
                                        0 => '铜仁市',
                                        1 => '江口县',
                                        2 => '玉屏侗族自治县',
                                        3 => '石阡县',
                                        4 => '思南县',
                                        5 => '印江土家族苗族自治县',
                                        6 => '德江县',
                                        7 => '沿河土家族自治县',
                                        8 => '松桃苗族自治县',
                                        9 => '万山特区',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '黔西南布依族苗族自治州',
                                'area' =>
                                    array(
                                        0 => '兴义市',
                                        1 => '兴仁县',
                                        2 => '普安县',
                                        3 => '晴隆县',
                                        4 => '贞丰县',
                                        5 => '望谟县',
                                        6 => '册亨县',
                                        7 => '安龙县',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '毕节地区',
                                'area' =>
                                    array(
                                        0 => '毕节市',
                                        1 => '大方县',
                                        2 => '黔西县',
                                        3 => '金沙县',
                                        4 => '织金县',
                                        5 => '纳雍县',
                                        6 => '威宁彝族回族苗族自治县',
                                        7 => '赫章县',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '黔东南苗族侗族自治州',
                                'area' =>
                                    array(
                                        0 => '凯里市',
                                        1 => '黄平县',
                                        2 => '施秉县',
                                        3 => '三穗县',
                                        4 => '镇远县',
                                        5 => '岑巩县',
                                        6 => '天柱县',
                                        7 => '锦屏县',
                                        8 => '剑河县',
                                        9 => '台江县',
                                        10 => '黎平县',
                                        11 => '榕江县',
                                        12 => '从江县',
                                        13 => '雷山县',
                                        14 => '麻江县',
                                        15 => '丹寨县',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '黔南布依族苗族自治州',
                                'area' =>
                                    array(
                                        0 => '都匀市',
                                        1 => '福泉市',
                                        2 => '荔波县',
                                        3 => '贵定县',
                                        4 => '瓮安县',
                                        5 => '独山县',
                                        6 => '平塘县',
                                        7 => '罗甸县',
                                        8 => '长顺县',
                                        9 => '龙里县',
                                        10 => '惠水县',
                                        11 => '三都水族自治县',
                                    ),
                            ),
                    ),
            ),
        24 =>
            array(
                'province_name' => '云南省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '昆明市',
                                'area' =>
                                    array(
                                        0 => '五华区',
                                        1 => '盘龙区',
                                        2 => '官渡区',
                                        3 => '西山区',
                                        4 => '东川区',
                                        5 => '呈贡县',
                                        6 => '晋宁县',
                                        7 => '富民县',
                                        8 => '宜良县',
                                        9 => '石林彝族自治县',
                                        10 => '嵩明县',
                                        11 => '禄劝彝族苗族自治县',
                                        12 => '寻甸回族彝族自治县',
                                        13 => '安宁市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '曲靖市',
                                'area' =>
                                    array(
                                        0 => '麒麟区',
                                        1 => '马龙县',
                                        2 => '陆良县',
                                        3 => '师宗县',
                                        4 => '罗平县',
                                        5 => '富源县',
                                        6 => '会泽县',
                                        7 => '沾益县',
                                        8 => '宣威市',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '玉溪市',
                                'area' =>
                                    array(
                                        0 => '红塔区',
                                        1 => '江川县',
                                        2 => '澄江县',
                                        3 => '通海县',
                                        4 => '华宁县',
                                        5 => '易门县',
                                        6 => '峨山彝族自治县',
                                        7 => '新平彝族傣族自治县',
                                        8 => '元江哈尼族彝族傣族自治县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '保山市',
                                'area' =>
                                    array(
                                        0 => '隆阳区',
                                        1 => '施甸县',
                                        2 => '腾冲县',
                                        3 => '龙陵县',
                                        4 => '昌宁县',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '昭通市',
                                'area' =>
                                    array(
                                        0 => '昭阳区',
                                        1 => '鲁甸县',
                                        2 => '巧家县',
                                        3 => '盐津县',
                                        4 => '大关县',
                                        5 => '永善县',
                                        6 => '绥江县',
                                        7 => '镇雄县',
                                        8 => '彝良县',
                                        9 => '威信县',
                                        10 => '水富县',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '丽江市',
                                'area' =>
                                    array(
                                        0 => '古城区',
                                        1 => '玉龙纳西族自治县',
                                        2 => '永胜县',
                                        3 => '华坪县',
                                        4 => '宁蒗彝族自治县',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '思茅市',
                                'area' =>
                                    array(
                                        0 => '翠云区',
                                        1 => '普洱哈尼族彝族自治县',
                                        2 => '墨江哈尼族自治县',
                                        3 => '景东彝族自治县',
                                        4 => '景谷傣族彝族自治县',
                                        5 => '镇沅彝族哈尼族拉祜族自治县',
                                        6 => '江城哈尼族彝族自治县',
                                        7 => '孟连傣族拉祜族佤族自治县',
                                        8 => '澜沧拉祜族自治县',
                                        9 => '西盟佤族自治县',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '临沧市',
                                'area' =>
                                    array(
                                        0 => '临翔区',
                                        1 => '凤庆县',
                                        2 => '云　县',
                                        3 => '永德县',
                                        4 => '镇康县',
                                        5 => '双江拉祜族佤族布朗族傣族自治县',
                                        6 => '耿马傣族佤族自治县',
                                        7 => '沧源佤族自治县',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '楚雄彝族自治州',
                                'area' =>
                                    array(
                                        0 => '楚雄市',
                                        1 => '双柏县',
                                        2 => '牟定县',
                                        3 => '南华县',
                                        4 => '姚安县',
                                        5 => '大姚县',
                                        6 => '永仁县',
                                        7 => '元谋县',
                                        8 => '武定县',
                                        9 => '禄丰县',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '红河哈尼族彝族自治州',
                                'area' =>
                                    array(
                                        0 => '个旧市',
                                        1 => '开远市',
                                        2 => '蒙自县',
                                        3 => '屏边苗族自治县',
                                        4 => '建水县',
                                        5 => '石屏县',
                                        6 => '弥勒县',
                                        7 => '泸西县',
                                        8 => '元阳县',
                                        9 => '红河县',
                                        10 => '金平苗族瑶族傣族自治县',
                                        11 => '绿春县',
                                        12 => '河口瑶族自治县',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '文山壮族苗族自治州',
                                'area' =>
                                    array(
                                        0 => '文山县',
                                        1 => '砚山县',
                                        2 => '西畴县',
                                        3 => '麻栗坡县',
                                        4 => '马关县',
                                        5 => '丘北县',
                                        6 => '广南县',
                                        7 => '富宁县',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '西双版纳傣族自治州',
                                'area' =>
                                    array(
                                        0 => '景洪市',
                                        1 => '勐海县',
                                        2 => '勐腊县',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '大理白族自治州',
                                'area' =>
                                    array(
                                        0 => '大理市',
                                        1 => '漾濞彝族自治县',
                                        2 => '祥云县',
                                        3 => '宾川县',
                                        4 => '弥渡县',
                                        5 => '南涧彝族自治县',
                                        6 => '巍山彝族回族自治县',
                                        7 => '永平县',
                                        8 => '云龙县',
                                        9 => '洱源县',
                                        10 => '剑川县',
                                        11 => '鹤庆县',
                                    ),
                            ),
                        13 =>
                            array(
                                'city_name' => '德宏傣族景颇族自治州',
                                'area' =>
                                    array(
                                        0 => '瑞丽市',
                                        1 => '潞西市',
                                        2 => '梁河县',
                                        3 => '盈江县',
                                        4 => '陇川县',
                                    ),
                            ),
                        14 =>
                            array(
                                'city_name' => '怒江傈僳族自治州',
                                'area' =>
                                    array(
                                        0 => '泸水县',
                                        1 => '福贡县',
                                        2 => '贡山独龙族怒族自治县',
                                        3 => '兰坪白族普米族自治县',
                                    ),
                            ),
                        15 =>
                            array(
                                'city_name' => '迪庆藏族自治州',
                                'area' =>
                                    array(
                                        0 => '香格里拉县',
                                        1 => '德钦县',
                                        2 => '维西傈僳族自治县',
                                    ),
                            ),
                    ),
            ),
        25 =>
            array(
                'province_name' => '西藏自治区',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '拉萨市',
                                'area' =>
                                    array(
                                        0 => '城关区',
                                        1 => '林周县',
                                        2 => '当雄县',
                                        3 => '尼木县',
                                        4 => '曲水县',
                                        5 => '堆龙德庆县',
                                        6 => '达孜县',
                                        7 => '墨竹工卡县',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '昌都地区',
                                'area' =>
                                    array(
                                        0 => '昌都县',
                                        1 => '江达县',
                                        2 => '贡觉县',
                                        3 => '类乌齐县',
                                        4 => '丁青县',
                                        5 => '察雅县',
                                        6 => '八宿县',
                                        7 => '左贡县',
                                        8 => '芒康县',
                                        9 => '洛隆县',
                                        10 => '边坝县',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '山南地区',
                                'area' =>
                                    array(
                                        0 => '乃东县',
                                        1 => '扎囊县',
                                        2 => '贡嘎县',
                                        3 => '桑日县',
                                        4 => '琼结县',
                                        5 => '曲松县',
                                        6 => '措美县',
                                        7 => '洛扎县',
                                        8 => '加查县',
                                        9 => '隆子县',
                                        10 => '错那县',
                                        11 => '浪卡子县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '日喀则地区',
                                'area' =>
                                    array(
                                        0 => '日喀则市',
                                        1 => '南木林县',
                                        2 => '江孜县',
                                        3 => '定日县',
                                        4 => '萨迦县',
                                        5 => '拉孜县',
                                        6 => '昂仁县',
                                        7 => '谢通门县',
                                        8 => '白朗县',
                                        9 => '仁布县',
                                        10 => '康马县',
                                        11 => '定结县',
                                        12 => '仲巴县',
                                        13 => '亚东县',
                                        14 => '吉隆县',
                                        15 => '聂拉木县',
                                        16 => '萨嘎县',
                                        17 => '岗巴县',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '那曲地区',
                                'area' =>
                                    array(
                                        0 => '那曲县',
                                        1 => '嘉黎县',
                                        2 => '比如县',
                                        3 => '聂荣县',
                                        4 => '安多县',
                                        5 => '申扎县',
                                        6 => '索　县',
                                        7 => '班戈县',
                                        8 => '巴青县',
                                        9 => '尼玛县',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '阿里地区',
                                'area' =>
                                    array(
                                        0 => '普兰县',
                                        1 => '札达县',
                                        2 => '噶尔县',
                                        3 => '日土县',
                                        4 => '革吉县',
                                        5 => '改则县',
                                        6 => '措勤县',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '林芝地区',
                                'area' =>
                                    array(
                                        0 => '林芝县',
                                        1 => '工布江达县',
                                        2 => '米林县',
                                        3 => '墨脱县',
                                        4 => '波密县',
                                        5 => '察隅县',
                                        6 => '朗　县',
                                    ),
                            ),
                    ),
            ),
        26 =>
            array(
                'province_name' => '陕西省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '西安市',
                                'area' =>
                                    array(
                                        0 => '新城区',
                                        1 => '碑林区',
                                        2 => '莲湖区',
                                        3 => '灞桥区',
                                        4 => '未央区',
                                        5 => '雁塔区',
                                        6 => '阎良区',
                                        7 => '临潼区',
                                        8 => '长安区',
                                        9 => '蓝田县',
                                        10 => '周至县',
                                        11 => '户　县',
                                        12 => '高陵县',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '铜川市',
                                'area' =>
                                    array(
                                        0 => '王益区',
                                        1 => '印台区',
                                        2 => '耀州区',
                                        3 => '宜君县',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '宝鸡市',
                                'area' =>
                                    array(
                                        0 => '渭滨区',
                                        1 => '金台区',
                                        2 => '陈仓区',
                                        3 => '凤翔县',
                                        4 => '岐山县',
                                        5 => '扶风县',
                                        6 => '眉　县',
                                        7 => '陇　县',
                                        8 => '千阳县',
                                        9 => '麟游县',
                                        10 => '凤　县',
                                        11 => '太白县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '咸阳市',
                                'area' =>
                                    array(
                                        0 => '秦都区',
                                        1 => '杨凌区',
                                        2 => '渭城区',
                                        3 => '三原县',
                                        4 => '泾阳县',
                                        5 => '乾　县',
                                        6 => '礼泉县',
                                        7 => '永寿县',
                                        8 => '彬　县',
                                        9 => '长武县',
                                        10 => '旬邑县',
                                        11 => '淳化县',
                                        12 => '武功县',
                                        13 => '兴平市',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '渭南市',
                                'area' =>
                                    array(
                                        0 => '临渭区',
                                        1 => '华　县',
                                        2 => '潼关县',
                                        3 => '大荔县',
                                        4 => '合阳县',
                                        5 => '澄城县',
                                        6 => '蒲城县',
                                        7 => '白水县',
                                        8 => '富平县',
                                        9 => '韩城市',
                                        10 => '华阴市',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '延安市',
                                'area' =>
                                    array(
                                        0 => '宝塔区',
                                        1 => '延长县',
                                        2 => '延川县',
                                        3 => '子长县',
                                        4 => '安塞县',
                                        5 => '志丹县',
                                        6 => '吴旗县',
                                        7 => '甘泉县',
                                        8 => '富　县',
                                        9 => '洛川县',
                                        10 => '宜川县',
                                        11 => '黄龙县',
                                        12 => '黄陵县',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '汉中市',
                                'area' =>
                                    array(
                                        0 => '汉台区',
                                        1 => '南郑县',
                                        2 => '城固县',
                                        3 => '洋　县',
                                        4 => '西乡县',
                                        5 => '勉　县',
                                        6 => '宁强县',
                                        7 => '略阳县',
                                        8 => '镇巴县',
                                        9 => '留坝县',
                                        10 => '佛坪县',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '榆林市',
                                'area' =>
                                    array(
                                        0 => '榆阳区',
                                        1 => '神木县',
                                        2 => '府谷县',
                                        3 => '横山县',
                                        4 => '靖边县',
                                        5 => '定边县',
                                        6 => '绥德县',
                                        7 => '米脂县',
                                        8 => '佳　县',
                                        9 => '吴堡县',
                                        10 => '清涧县',
                                        11 => '子洲县',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '安康市',
                                'area' =>
                                    array(
                                        0 => '汉滨区',
                                        1 => '汉阴县',
                                        2 => '石泉县',
                                        3 => '宁陕县',
                                        4 => '紫阳县',
                                        5 => '岚皋县',
                                        6 => '平利县',
                                        7 => '镇坪县',
                                        8 => '旬阳县',
                                        9 => '白河县',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '商洛市',
                                'area' =>
                                    array(
                                        0 => '商州区',
                                        1 => '洛南县',
                                        2 => '丹凤县',
                                        3 => '商南县',
                                        4 => '山阳县',
                                        5 => '镇安县',
                                        6 => '柞水县',
                                    ),
                            ),
                    ),
            ),
        27 =>
            array(
                'province_name' => '甘肃省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '兰州市',
                                'area' =>
                                    array(
                                        0 => '城关区',
                                        1 => '七里河区',
                                        2 => '西固区',
                                        3 => '安宁区',
                                        4 => '红古区',
                                        5 => '永登县',
                                        6 => '皋兰县',
                                        7 => '榆中县',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '嘉峪关市',
                            ),
                        2 =>
                            array(
                                'city_name' => '金昌市',
                                'area' =>
                                    array(
                                        0 => '金川区',
                                        1 => '永昌县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '白银市',
                                'area' =>
                                    array(
                                        0 => '白银区',
                                        1 => '平川区',
                                        2 => '靖远县',
                                        3 => '会宁县',
                                        4 => '景泰县',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '天水市',
                                'area' =>
                                    array(
                                        0 => '秦城区',
                                        1 => '北道区',
                                        2 => '清水县',
                                        3 => '秦安县',
                                        4 => '甘谷县',
                                        5 => '武山县',
                                        6 => '张家川回族自治县',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '武威市',
                                'area' =>
                                    array(
                                        0 => '凉州区',
                                        1 => '民勤县',
                                        2 => '古浪县',
                                        3 => '天祝藏族自治县',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '张掖市',
                                'area' =>
                                    array(
                                        0 => '甘州区',
                                        1 => '肃南裕固族自治县',
                                        2 => '民乐县',
                                        3 => '临泽县',
                                        4 => '高台县',
                                        5 => '山丹县',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '平凉市',
                                'area' =>
                                    array(
                                        0 => '崆峒区',
                                        1 => '泾川县',
                                        2 => '灵台县',
                                        3 => '崇信县',
                                        4 => '华亭县',
                                        5 => '庄浪县',
                                        6 => '静宁县',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '酒泉市',
                                'area' =>
                                    array(
                                        0 => '肃州区',
                                        1 => '金塔县',
                                        2 => '安西县',
                                        3 => '肃北蒙古族自治县',
                                        4 => '阿克塞哈萨克族自治县',
                                        5 => '玉门市',
                                        6 => '敦煌市',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '庆阳市',
                                'area' =>
                                    array(
                                        0 => '西峰区',
                                        1 => '庆城县',
                                        2 => '环　县',
                                        3 => '华池县',
                                        4 => '合水县',
                                        5 => '正宁县',
                                        6 => '宁　县',
                                        7 => '镇原县',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '定西市',
                                'area' =>
                                    array(
                                        0 => '安定区',
                                        1 => '通渭县',
                                        2 => '陇西县',
                                        3 => '渭源县',
                                        4 => '临洮县',
                                        5 => '漳　县',
                                        6 => '岷　县',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '陇南市',
                                'area' =>
                                    array(
                                        0 => '武都区',
                                        1 => '成　县',
                                        2 => '文　县',
                                        3 => '宕昌县',
                                        4 => '康　县',
                                        5 => '西和县',
                                        6 => '礼　县',
                                        7 => '徽　县',
                                        8 => '两当县',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '临夏回族自治州',
                                'area' =>
                                    array(
                                        0 => '临夏市',
                                        1 => '临夏县',
                                        2 => '康乐县',
                                        3 => '永靖县',
                                        4 => '广河县',
                                        5 => '和政县',
                                        6 => '东乡族自治县',
                                        7 => '积石山保安族东乡族撒拉族自治县',
                                    ),
                            ),
                        13 =>
                            array(
                                'city_name' => '甘南藏族自治州',
                                'area' =>
                                    array(
                                        0 => '合作市',
                                        1 => '临潭县',
                                        2 => '卓尼县',
                                        3 => '舟曲县',
                                        4 => '迭部县',
                                        5 => '玛曲县',
                                        6 => '碌曲县',
                                        7 => '夏河县',
                                    ),
                            ),
                    ),
            ),
        28 =>
            array(
                'province_name' => '青海省',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '西宁市',
                                'area' =>
                                    array(
                                        0 => '城东区',
                                        1 => '城中区',
                                        2 => '城西区',
                                        3 => '城北区',
                                        4 => '大通回族土族自治县',
                                        5 => '湟中县',
                                        6 => '湟源县',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '海东地区',
                                'area' =>
                                    array(
                                        0 => '平安县',
                                        1 => '民和回族土族自治县',
                                        2 => '乐都县',
                                        3 => '互助土族自治县',
                                        4 => '化隆回族自治县',
                                        5 => '循化撒拉族自治县',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '海北藏族自治州',
                                'area' =>
                                    array(
                                        0 => '门源回族自治县',
                                        1 => '祁连县',
                                        2 => '海晏县',
                                        3 => '刚察县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '黄南藏族自治州',
                                'area' =>
                                    array(
                                        0 => '同仁县',
                                        1 => '尖扎县',
                                        2 => '泽库县',
                                        3 => '河南蒙古族自治县',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '海南藏族自治州',
                                'area' =>
                                    array(
                                        0 => '共和县',
                                        1 => '同德县',
                                        2 => '贵德县',
                                        3 => '兴海县',
                                        4 => '贵南县',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '果洛藏族自治州',
                                'area' =>
                                    array(
                                        0 => '玛沁县',
                                        1 => '班玛县',
                                        2 => '甘德县',
                                        3 => '达日县',
                                        4 => '久治县',
                                        5 => '玛多县',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '玉树藏族自治州',
                                'area' =>
                                    array(
                                        0 => '玉树县',
                                        1 => '杂多县',
                                        2 => '称多县',
                                        3 => '治多县',
                                        4 => '囊谦县',
                                        5 => '曲麻莱县',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '海西蒙古族藏族自治州',
                                'area' =>
                                    array(
                                        0 => '格尔木市',
                                        1 => '德令哈市',
                                        2 => '乌兰县',
                                        3 => '都兰县',
                                        4 => '天峻县',
                                    ),
                            ),
                    ),
            ),
        29 =>
            array(
                'province_name' => '宁夏回族自治区',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '银川市',
                                'area' =>
                                    array(
                                        0 => '兴庆区',
                                        1 => '西夏区',
                                        2 => '金凤区',
                                        3 => '永宁县',
                                        4 => '贺兰县',
                                        5 => '灵武市',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '石嘴山市',
                                'area' =>
                                    array(
                                        0 => '大武口区',
                                        1 => '惠农区',
                                        2 => '平罗县',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '吴忠市',
                                'area' =>
                                    array(
                                        0 => '利通区',
                                        1 => '盐池县',
                                        2 => '同心县',
                                        3 => '青铜峡市',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '固原市',
                                'area' =>
                                    array(
                                        0 => '原州区',
                                        1 => '西吉县',
                                        2 => '隆德县',
                                        3 => '泾源县',
                                        4 => '彭阳县',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '中卫市',
                                'area' =>
                                    array(
                                        0 => '沙坡头区',
                                        1 => '中宁县',
                                        2 => '海原县',
                                    ),
                            ),
                    ),
            ),
        30 =>
            array(
                'province_name' => '新疆维吾尔自治区',
                'city' =>
                    array(
                        0 =>
                            array(
                                'city_name' => '乌鲁木齐市',
                                'area' =>
                                    array(
                                        0 => '天山区',
                                        1 => '沙依巴克区',
                                        2 => '新市区',
                                        3 => '水磨沟区',
                                        4 => '头屯河区',
                                        5 => '达坂城区',
                                        6 => '东山区',
                                        7 => '乌鲁木齐县',
                                    ),
                            ),
                        1 =>
                            array(
                                'city_name' => '克拉玛依市',
                                'area' =>
                                    array(
                                        0 => '独山子区',
                                        1 => '克拉玛依区',
                                        2 => '白碱滩区',
                                        3 => '乌尔禾区',
                                    ),
                            ),
                        2 =>
                            array(
                                'city_name' => '吐鲁番地区',
                                'area' =>
                                    array(
                                        0 => '吐鲁番市',
                                        1 => '鄯善县',
                                        2 => '托克逊县',
                                    ),
                            ),
                        3 =>
                            array(
                                'city_name' => '哈密地区',
                                'area' =>
                                    array(
                                        0 => '哈密市',
                                        1 => '巴里坤哈萨克自治县',
                                        2 => '伊吾县',
                                    ),
                            ),
                        4 =>
                            array(
                                'city_name' => '昌吉回族自治州',
                                'area' =>
                                    array(
                                        0 => '昌吉市',
                                        1 => '阜康市',
                                        2 => '米泉市',
                                        3 => '呼图壁县',
                                        4 => '玛纳斯县',
                                        5 => '奇台县',
                                        6 => '吉木萨尔县',
                                        7 => '木垒哈萨克自治县',
                                    ),
                            ),
                        5 =>
                            array(
                                'city_name' => '博尔塔拉蒙古自治州',
                                'area' =>
                                    array(
                                        0 => '博乐市',
                                        1 => '精河县',
                                        2 => '温泉县',
                                    ),
                            ),
                        6 =>
                            array(
                                'city_name' => '巴音郭楞蒙古自治州',
                                'area' =>
                                    array(
                                        0 => '库尔勒市',
                                        1 => '轮台县',
                                        2 => '尉犁县',
                                        3 => '若羌县',
                                        4 => '且末县',
                                        5 => '焉耆回族自治县',
                                        6 => '和静县',
                                        7 => '和硕县',
                                        8 => '博湖县',
                                    ),
                            ),
                        7 =>
                            array(
                                'city_name' => '阿克苏地区',
                                'area' =>
                                    array(
                                        0 => '阿克苏市',
                                        1 => '温宿县',
                                        2 => '库车县',
                                        3 => '沙雅县',
                                        4 => '新和县',
                                        5 => '拜城县',
                                        6 => '乌什县',
                                        7 => '阿瓦提县',
                                        8 => '柯坪县',
                                    ),
                            ),
                        8 =>
                            array(
                                'city_name' => '克孜勒苏柯尔克孜自治州',
                                'area' =>
                                    array(
                                        0 => '阿图什市',
                                        1 => '阿克陶县',
                                        2 => '阿合奇县',
                                        3 => '乌恰县',
                                    ),
                            ),
                        9 =>
                            array(
                                'city_name' => '喀什地区',
                                'area' =>
                                    array(
                                        0 => '喀什市',
                                        1 => '疏附县',
                                        2 => '疏勒县',
                                        3 => '英吉沙县',
                                        4 => '泽普县',
                                        5 => '莎车县',
                                        6 => '叶城县',
                                        7 => '麦盖提县',
                                        8 => '岳普湖县',
                                        9 => '伽师县',
                                        10 => '巴楚县',
                                        11 => '塔什库尔干塔吉克自治县',
                                    ),
                            ),
                        10 =>
                            array(
                                'city_name' => '和田地区',
                                'area' =>
                                    array(
                                        0 => '和田市',
                                        1 => '和田县',
                                        2 => '墨玉县',
                                        3 => '皮山县',
                                        4 => '洛浦县',
                                        5 => '策勒县',
                                        6 => '于田县',
                                        7 => '民丰县',
                                    ),
                            ),
                        11 =>
                            array(
                                'city_name' => '伊犁哈萨克自治州',
                                'area' =>
                                    array(
                                        0 => '伊宁市',
                                        1 => '奎屯市',
                                        2 => '伊宁县',
                                        3 => '察布查尔锡伯自治县',
                                        4 => '霍城县',
                                        5 => '巩留县',
                                        6 => '新源县',
                                        7 => '昭苏县',
                                        8 => '特克斯县',
                                        9 => '尼勒克县',
                                    ),
                            ),
                        12 =>
                            array(
                                'city_name' => '塔城地区',
                                'area' =>
                                    array(
                                        0 => '塔城市',
                                        1 => '乌苏市',
                                        2 => '额敏县',
                                        3 => '沙湾县',
                                        4 => '托里县',
                                        5 => '裕民县',
                                        6 => '和布克赛尔蒙古自治县',
                                    ),
                            ),
                        13 =>
                            array(
                                'city_name' => '阿勒泰地区',
                                'area' =>
                                    array(
                                        0 => '阿勒泰市',
                                        1 => '布尔津县',
                                        2 => '富蕴县',
                                        3 => '福海县',
                                        4 => '哈巴河县',
                                        5 => '青河县',
                                        6 => '吉木乃县',
                                    ),
                            ),
                        14 =>
                            array(
                                'city_name' => '省直辖行政单位',
                                'area' =>
                                    array(
                                        0 => '石河子市',
                                        1 => '阿拉尔市',
                                        2 => '图木舒克市',
                                        3 => '五家渠市',
                                    ),
                            ),
                    ),
            ),
        31 =>
            array(
                'province_name' => '台湾省',
            ),
        32 =>
            array(
                'province_name' => '香港特别行政区',
            ),
        33 =>
            array(
                'province_name' => '澳门特别行政区',
            ),
    );
}

